[{"Image":"https://i.postimg.cc/JnJkD6NG/Fortnite.png",
"Banner":"https://i.postimg.cc/8cZFcxYK/Fortnite-Banner.jpg",
"Description":"Fortnite: Battle Royale\n\nFortnite is a globally popular online multiplayer game that offers an intense and immersive Battle Royale experience. Developed by Epic Games, Fortnite has redefined the gaming landscape with its unique blend of vibrant graphics, innovative gameplay mechanics, and a highly engaging community.\n\nIn Fortnite, 100 players are dropped onto a large, ever-shrinking map, where they must scavenge for weapons, resources, and items while eliminating opponents to be the last person or team standing. The game features a distinctive building system, allowing players to gather materials to construct structures, offering a strategic advantage in battles. Whether you're building towering fortresses, crafting intricate defences, or outmanoeuvring your opponents, Fortnite's dynamic gameplay ensures that every match is a thrilling experience.\n\nFortnite's appeal goes beyond just the Battle Royale mode. The game regularly hosts limited-time events, live concerts, and collaborations with popular franchises, keeping the content fresh and exciting. Players can personalise their in-game avatars with a wide range of skins, emotes, and other cosmetic items, allowing for a truly customised gaming experience.\n\nThe game is available across multiple platforms, including PC, consoles, and mobile devices, with cross-platform play enabling friends to team up regardless of their chosen device. Fortnite is free-to-play, but offers in-game purchases for cosmetic items and battle passes, which unlock additional rewards as players progress through the game.\n\nWith its blend of fast-paced action, creative freedom, and a constantly evolving world, Fortnite continues to be a dominant force in the gaming industry, attracting millions of players worldwide. Whether you're a casual gamer or a competitive player, Fortnite offers something for everyone, making it a must-play for anyone looking to dive into the ultimate Battle Royale experience.",
"U":"January 8, 2026",
"V":"39.11.0-49292084-Android",
"BV":"39.11.0-49292084-Android",
"FileName":"Fortnite 39.11.apk",
"Link":"https://st7.ranoz.gg/5T45kfSa-Fortnite%2039.11%20By%20Brotherz%20Gaming.apk",
"Link2":"https://st7.ranoz.gg/5T45kfSa-Fortnite%2039.11%20By%20Brotherz%20Gaming.apk",
"Link3":"https://st7.ranoz.gg/5T45kfSa-Fortnite%2039.11%20By%20Brotherz%20Gaming.apk",
"P-Link":"https://st7.ranoz.gg/5T45kfSa-Fortnite%2039.11%20By%20Brotherz%20Gaming.apk",
"Size":"332.56 Mb"},

{"Image":"https://i.postimg.cc/MHSjy75t/VoiD-FX.png",
"Banner":"https://i.postimg.cc/9fShJBWd/Void-Fx-Banner.png",
"Description":"VoiD FX is a versatile and powerful utility designed by Brotherz Gaming to enhance the visual experience of Fortnite gameplay. With a range of features tailored to optimize graphics settings, customize effects, and improve performance, it offers users the ability to fine-tune their gaming experience to suit their preferences and device capabilities.\n\nVoiD FX puts you in control of your Fortnite gaming experience, offering precise adjustments to four essential settings for optimal gameplay.\n\nFirstly, the FPS adjustment feature lets you fine-tune the frame rate to match your preferences and hardware capabilities. Whether you prioritize smooth performance or maximum visual detail, you can customize the FPS settings to suit your needs.\n\nThe Show FPS toggle provides allows you to enable or disable on-screen fps meter according to your needs.\n\nVsync management synchronizes the frame rate of your game with your device's refresh rate, minimizing screen tearing for a smoother gaming experience.\n\nLastly, Anti-Aliasing customization enhances visual quality by reducing jagged edges and improving overall image clarity.\n\nWith these features, VoiD FX empowers you to customize your Fortnite graphics for an optimized gaming experience.",
"U":"January 8, 2026",
"V":"6.8",
"BV":"6.8",
"Link":"https://st7.ranoz.gg/7RRTY4Eu-VoiD%20FX%206.8.apk",
"Link2":"https://st7.ranoz.gg/7RRTY4Eu-VoiD%20FX%206.8.apk",
"Link3":"https://st7.ranoz.gg/7RRTY4Eu-VoiD%20FX%206.8.apk",
"P-Link":"https://st7.ranoz.gg/7RRTY4Eu-VoiD%20FX%206.8.apk",
"FileName":"VoiDFX 6.8.apk",
"New":"• Updated For Fortnite V-39.11",
"Size":"3.40 Mb"},
 
{"Advert":"True",
"OnClick":"Null",
"ImgLink":"https://i.postimg.cc/Px9CxckW/banner.png",
"Ads":["True", "5578065", "Rewarded_Android"],
"Service":"True",
"C_ID":"BsVJ3hh-YJoLPtPGDkkEuoFEnV-QV_r3qzCGSHOPEYnsnK_bu0glaPEmZ66gkPQg",
"Red_URI":"https://pixlverify.netlify.app/.netlify/functions/patreon-redirect",
"C_URL":"https://www.patreon.com/brotherzgg",
"V_URL":"https://pixlverify.netlify.app/.netlify/functions/patreon-verify",
"Ref_URL":"https://pixlverify.netlify.app/.netlify/functions/patreon-refresh",
"A_KEY":"BGSECURE786",
"TutoThumb":"https://i.postimg.cc/qMWHhMrK/Tutorial-Thumbnail.jpg",
"TutoLink":"https://youtu.be/0raq4Y-pSQI?si=F7AL8PQmiSWMIh3d"},

{"Maintenance": "False",
"Version": "4.1",
"Link": "https://dl.dropboxusercontent.com/scl/fi/2u2jcazrrfwoeysf3sist/PixL-4.1.apk?rlkey=0sbfql6hdkqpjph9uo681rfrp&st=zwuctzvq&dl=0",
"Size": "4.73 Mb",
"Name": "PixL 4.1.apk",
"Changelog": "• Added option to cancel downloads\n• Various Bug Fixes And Improvements\n\nTo view the full changelog, go to About Us → Changelog",
"Privacy": "https://pixl-app.netlify.app/privacy-policy"}]
