[{"Name":"Great Conqueror 2 Shogun",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhT2u3ZpZKq_hgjVk5pYovLyweFfZ0ZYOCTobGg2j7hyphenhyphensBqnMBFNaiXHHvff4f9uueFEbPF4ns9GcwUScLGLvVsSYxNpGO1kdW0ShyF4K3l6IzSpQv78-OyeanM5ejAbvgzkL20ZmdABfMvf_y9FGRJpNfHacjW6dnPJUpUftI66O_4LKhEEDMDJ3AUXyIB/w680/unnamed%20(1).webp",
"Description":"Great Conqueror 2 Shogun is an epic strategy game taking place during the chaotic Sengoku Era of Japan, where you will play the role of a fearless warrior Shogun and will observe an entire historical era, its ups and downs, military confrontations, the spirit of competition and conflict situations, power struggles and historical battles. In this game you will be able to take part in real historical battles, observe and participate in various events and progress through 16 chapters of an impressive storyline. All events and battles will be imbued with traditional Japanese flavor, an unforgettable atmosphere and memorable surroundings.\nEmbark on a historical journey with Great Conqueror 2 Shogun, go into the thick of it events, take part in battles, cope with difficult combat missions, receive generous rewards for victories, conquer new territories, unite regions and adapt your tactical decisions to changing events. Here you can improve your strategic skills and think through steps ahead, try out various tactical solutions in order to achieve the desired outcome in each battle. You will take control of the troops, hire legendary generals, form troops, equip fighters with powerful equipment, look for powerful artifacts and gain the various benefits they bestow.",
"M":"Unlimited Coins\nUnlimited Ban-Kin",
"U":"November 25, 2023",
"V":"1.0.8",
"Link":"https://www.mediafire.com/file/sx3qns830hsfve0/Great_Conqueror_2_Shogun_1.0.8_Mod_By_Brotherz_Gaming.apk/file",
"Size":"649.77"},

{"Name":"Vector 2 Premium",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiX6R4IPx5Mo74ne8FM2SqDdGgj6O1JsXkx7c-u837JOXHF9-DD2UxgrjoP70pVXvvCQigtd18wkp5r2CEEpDv6vMbPIb2e0zlh46XYma5nFaV-uCsADD2XSF-bJiOcQ96pfctXbVFIoUTbm6VdwwCVjZi9ZEm-AfVt0zZ_7zYfCY7Tbm2QoSTzLu7BArrs/w680/vector-2-premium.webp",
"Description":"The continuation of an incredible game about the parkourist, behind whom people from the scientific complex are chasing.The protagonist must pass many tests to become an agent in spec service. The process of passing is divided into levels, which are quite short, but contain a large number of traps and obstacles, so no time to relax. And if some levels were given to the first approach, in the update to repeat this would be virtually impossible. You should bear in mind that in case of failure of the operation of our agent discards the previous stage.\nTo start certain tasks the player will have to fork out for a special game currency that is earned in the process of passing the Vector 2. In the case of multiple failure in a row, the main character goes to rest until then, until you recover energy.\nThe obvious drawback of the game are insurmountable areas on some levels. They can go only in case if the agent will get a special shoes or other equipment. These improvements can be bought in-game store for the currency that accumulates with the passage of the jobs.\nManagement is carried out by gestures, and can say that it has remained untouched since the release of the first game. Action-arcade game Vector 2 is a worthy continuation of the legendary game, which will delight with its innovative approach to the development of the plot.",
"M":"Unlimited Money",
"Note":"You Can Buy Anything With 0 Cost",
"U":"November 12, 2023",
"V":"1.2.1",
"Link":"https://www.mediafire.com/file/oaqrmsepalgkn7x/Vector_2_Premium_1.2.1_Mod_By_Brotherz_Gaming.apk/file",
"Size":"125.66"},

{"Name":"Fortress Under Siege HD",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiIs03buSxp1zHvRIhDS2p-F7u7A9pkfP2Pxx4kmQ2K66m7C7JCd78qOxP1Y_SPV_9qBi5PPf0nPvyurz5z_0vY06IFx9aDYqF_xRY_HjxlrypkX7HbQLdqHsaaphR8q3KUd5Y1y1qxcCHwwfpLHyQRDTV9VVcLc8hWkVqU9rw6mJGmW3-hs3kBD3TDva4h/w680/unnamed.webp",
"Description":"A strategy game that will take the player into the epicenter of a large-scale confrontation. The user will have to participate in the battle for the protection of his own Kingdom from the treacherous attack of the enemy that will approach the fortress walls. To meet him you need to be prepared, so gamers must place the defense in the best way. Erecting fortifications, moving stone walls and positioning combat units in the right places can greatly enhance the protective potential of the fortress and throw regular enemies and bosses.",
"M":"Unlimited Money",
"U":"September 29, 2023",
"V":"1.4.6",
"Link":"https://www.mediafire.com/file/rm7g9xqux08m9wb/Fortress_Under_Siege_1.4.6_Mod_By_Brotherz_Gaming.apk/file",
"Size":"46.53"},

{"Name":"Glory Of Generals Pacific HD",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhWz90PPGuawfAZCjXIdOugY2EorkvNUpVKfAvdgM_MZpLTikIYCmPXLEPQFxzG7uCB6lmsOsX3ZXX4Fl1KboGRDaoSyBoV5vjzrCY4fy19EBBd9xcnF500YqZ3t96H6TNE7KPxhGHCRqIpn1ABdMxtXYqxPonIyq5YqMC6rOAiFprfg1ceQTRMgGeyWRsE/w680/unnamed.webp",
"Description":"A turn-based historical strategy game, offering players to take part in dozens of military battles that really took place within the various conflicts. The game will be in the Pacific, and the battle will affect the events of the Second World War, the Korean War, the conflict in the Middle East, etc. Only the user will be able to take the side of almost 40 States. Depending on the selected country at his disposal will be a unique combat units, commanders, and other means of achieving victory.\nOver 64 campaigns in 4 battlefields are waiting for your challenge. 105 world famous generals will participate in this war with you. Over 300 real and rich terrains will influence your strategies.\nPlayer needs to make adequate use of battlefield terrains and defense facilities as well as expertise of each unit to win advantage. Cutting retreat route or encircling enemy will bring great change to battlefield situation. How to smartly deploy land, naval and air force to seize opponent’s key strongholds is a question lingering in player’s mind.\nAccumulation of Medals achieved through battles guides your way from soldier to marshal. Upgrade of military facilities in the headquarters will offer essential supply in the war. Recruit other officers to strengthen force. It’s important to take advantage of each officer’s expertise. Player can instruct any officer and his troop in battlefield to battle freely.",
"M":"Unlimited HealthKits\nUnlimited Medals",
"U":"September 24, 2023",
"V":"1.3.14",
"Link":"https://www.mediafire.com/file/da3118jmjnzwuf5/Glory_Of_Generals_Pacific_HD_1.3.14_Mod_By_Brotherz_Gaming.apk/file",
"Size":"50.34"},

{"Name":"Glory Of Generals HD",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgZtTKC8udv0Eau0frteT36TrdzQNy76VorYmfMPQQTyEuRk3zFNTuT-PPTBGFAKbk0IbaO-A3VIGSQsJcjkUMrkHnPwxWerUKpCyKiNb5EECatOjDZJHrwX04Amw-ISU0eMe1iKXCiBTHMqXf43z5ePC2Z0b-I9ekY1TbUQzUyi2bu56HNuw1-vvI-d_GS/w680/unnamed.webp",
"Description":"A popular simulation war strategy game that transports players to the epic battlefields of World War 2. In this game, the player will play a general, command and manage his own army, participate in various important battles, and win victory for his camp.\n\nA total of 60 historically accurate battles await players in the game, including major battles during World War 2 and many classic battles. For example, players can participate in historically famous battles such as the D-Day landings, the Battle of Stalingrad, and the Winter War. Each campaign has been carefully designed to keep the game challenging and replayable.\n\nPlayers need to take strategic decisions, including deploying troops, allocating resources, and making rational use of various tactics. Depending on the terrain and enemies, players can choose different types of troops, including infantry, tanks, artillery, etc., and improve their capabilities through upgrades and training. In addition, players can also recruit new generals and soldiers to form powerful troops.",
"M":"Unlimited HealthKits\nUnlimited Medals",
"U":"September 17, 2023",
"V":"1.2.16",
"Link":"https://www.mediafire.com/file/e299q0ueii6146m/Glory_Of_Generals_HD_1.2.16_Mod_By_Brotherz_Gaming.apk/file",
"Size":"82.44"},

{"Name":"European War 3",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjrDH1T_CNekhWO-9-9gIZy7bkHkf29gRzi7njNV-aIvQ5LwHae8C1U5J_WP30o1nvEx41UPfLXg9Xp8ohbV1bogJvfbO6sF2jtOcNArf4cddBUcqnjJHoIb6QgH-JAVqDmitwnfUmX3JbUtrX8otOzSH1YaySgNi1uC5LFNUFUsQxbLRKc_cBwWjGEkOf2/w680/unnamed.webp",
"Description":"A war strategy game that allows you to go back to the war period in European history and experience the excitement and challenge of commanding armies and conquering territories. In this game, you will play the role of a strategist, leading your army to conquer the European continent and fight for dominance.\n\nThe game reproduces the European war period from the 18th century to the 19th century, including historical events such as the Napoleonic Wars and the War of Independence. You can choose to play as the leader of different countries, such as France, Britain, Prussia, etc., each country has unique characteristics and arms. You need to develop a strategic plan, develop the economy, recruit troops, conquer territories, and finally achieve the unification of Europe.\n\nThe game provides a variety of campaign and battle modes, including single-player mode and multiplayer battle. In the single-player mode, you will challenge various historical battles, such as the Battle of Waterloo, the Battle of Shuilufeng, etc., and reenact historical war scenes. In multiplayer battles, you can compete against other players in real time, testing your strategy and command skills.\n\nEuropean War 3 focuses on strategy and decision-making, where you need to consider the allocation of resources, the formation of armies and the choice of tactics. You can build military bases, train soldiers, research and develop technology, and improve the combat effectiveness and strength of the army. At the same time, diplomacy and negotiation are also an important part of the game. You can negotiate with other countries, establish alliances, sign treaties, and affect the structure of Europe.",
"M":"Unlimited Medals",
"U":"September 10, 2023",
"V":"1.4.2",
"Link":"https://www.mediafire.com/file/i6l9l2qegv1uka1/European_War_3_1.4.2_Mod_By_Brotherz_Gaming.apk/file",
"Size":"91.26"},

{"Name":"European War 6 : 1914",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh_HGM_1Cw8R4IPgXAwbEGoXJMVWVQtM2iXo0a4rFFvmFhv30KNDhPNsTAaJV5OXaAS0_IOc7_6HzQmOf1a-JHcvsRrqhbfaaSjw9It94o7T6H5aCqL4FIUAbYzwNgjYPhd11f0quvvyl9RhA4O_fNoMODiPGJzO_EW3j7uTo2Y-JEmQEsYJpLpNHdFLA/w680/unnamed.webp",
"Description":"A global military strategy game which will unfold in Europe during the First world war. Rapid industrialization and technological progress has led to the fact that many European States began to grow rapidly and wanted to take a piece of the pie on the world map. This desire gave rise to the conflict and became a catalyst for the outbreak of hostilities. The player will take a direct part in the battles of the war. To achieve a positive result, he will have to give orders, assign military commanders to conduct diplomatic negotiations with the allied countries, as well as to modernize the army and technology.",
"M":"Unlimited Money\nUnlimited Medals",
"U":"August 20, 2023",
"V":"1.3.40",
"Link":"https://www.mediafire.com/file/ef1s3s86pjoylz9/European_War_6_1914_1.3.40_Mod_By_Brotherz_Gaming.apk/file",
"Size":"103.56"},

{"Name":"Grand War 2",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjwPjmGVWMNN6MgziTG6pcXb-ZHNQN3s8qTgGSWSZvDR_rc8wMyqm_GJgaJXjKkmLHHKpAbxwholilvYm2XJckq5s-q11f8OsVBfRsruyb1jFCNaGfrEdvlEOszg-HUjTPpLHO5ZEUnnc8hNj71kvq2qc--6dejVQoQTZy-3n4teEMFChRKJzgsDf8Haw/w680/unnamed.webp",
"Description":"The Great European War is about to begin, join the ranks of a European general to lead great military operations, conquer territories, conquer historic moments. Demonstrate leadership, hire the best generals to subdue thousands of troops. Launch offensives, declare war on neighbouring countries and conquer territories, planting your banner in new lands. Conquer Europe by becoming a mighty empire on the continents and take part in the realistic history of those times, taking part in historic European wars. Build your own strategy in historic European military battles, walk through the history of the Napoleonic War, the Battle of Trafalgar, the Battle of Leipzig and many others.\n\nLeave your great mark on the military actions of European wars that will not be forgotten for hundreds of years. Build up your forces with upgrades to hone your army's skills, making it more powerful than ever before and use strategy in war against the enemy. 3D battles await you, where you build your own attacks on the battlefield. Each war differs in terrain that demands a new plan of warfare, and you must be ready for any challenge to lure your enemies to your side and destroy them.",
"M":"Unlimited Money\nUnlimited Medals",
"U":"July 8, 2023",
"V":"60.9",
"Link":"https://www.mediafire.com/file/8dg5l5g7d6yh9bt/Grand_War_2_60.9_Mod_By_Brotherz_Gaming.apk/file",
"Size":"588.97"},

{"Name":"Let's Survive",
"Category":"Simulation",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi2S1CMC2CveeW_ctKwupM5LfiWvvwuikkFFcaMekvalkJrXDLPdyoBhDstuS67CaGqHGsAIf5PITFAiEx87YCIgbu9LxRr01PXT5Yuddi7VmIGESxQ7D-PuT-7frHgZAcZ-qA5qfXQiUu1soDZx9mk63INMl6xAvixnj_cFUqXlDXI2HPhZ2Atb9lt4zyy/w680/unnamed.webp",
"Description":"A simulator in which you will find yourself in the middle of an apocalyptic world of zombies, mutated animals and not a single hint of flapless zone and civilisation. A huge world to explore and fight for your life, the atmosphere of this eerie world will make you feel the gravity of survival.\n\nThe island will force you to begin tasks immediately in order to survive. Start your survival by starting tasks and completing them to make yourself stronger and ensure a small percentage of survivability, mine the necessary resources to craft weapons and equipment. It seems that the end of the world has come and there is no other life, but there are still survivors, to save them you can unite and start together to confront the monsters, zombies and the whole apocalyptic world.\n\nCreate your own camp to serve as the best place for shovel-free zones, overnight stays and many other activities. Improve the defences of your home, build structures that will protect the living from the dead and serve as a valuable shield. Create your own civilisation and gradually bring life back to the world, starting with your own territory. Expand your base with new fortifications and discoveries, and embark on a great adventure in search of all-new items and resources.\n\nNew storylines, meet more and more interesting survivors and their stories, create the strongest faction of survival heroes with them. Get around quickly by building your own transport from the many parts scattered around the island. Explore the land from the inside, build a secure bunker that will withstand any rebellion from the outside.",
"M":"Unlimited Money\nFree Craft\nRemoved Level Requirements For Crafting\nPremium Packs Purchased",
"U":"July 12, 2023",
"V":"1.6.3.1",
"Link":"https://www.mediafire.com/file/0wybv456apo2xjm/Lets_Survive_1.6.3_Mod_By_Brotherz_Gaming.apk/file",
"Size":"145.67"},

{"Name":"Smash Colors 3D",
"Category":"Music",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiP2w2RQFLfDII8VR-MPWJIrGHO5a2dmI3ScRXeL5bSH8KfZSs_0eHghkzUiv9dfwQg3C3FyBGkEHIgE7uvouuzDqDvOCbCpDKDTPc38ecE4HxWj9FWo5adFqUQMlMh4g1RFiqZ2gD2VEa7-zU3zEG7qEeNjGjrlLJkKSOOVfQAmNpMMJZYFsZlZr3GupWb/w680/unnamed.webp",
"Description":"A musical arcade game with simple controls and addictive gameplay. In this game the user will pass the levels by burning the tracks in accordance with a given rhythm. To pass he has to control a colored ball, which on the way to break blocks with an identical colors. In the event of a collision with a block of another color promotion will stop. Earned in the course of overcoming of stages points can be spent on the purchase of skins for the ball and other interesting things.",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"1.1.7",
"Link":"https://www.mediafire.com/file/3p3quhis2fjat1j/Smash_Colors_3D_1.1.7_Mod_By_Brotherz_Gaming.apk/file",
"Size":"73.46"},

{"Name":"Candy Crush Soda Saga",
"Category":"Casual",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiGpGpcuGYp3C1pBShnkDzh61KRejBASHiw3T2NY_CUv2gYwh_Cnrx_ZfPyZgRCvVhlgk51-EYhx6sQWnmm4kKjHFwMjEa_1SRTKznUBjIfvQnmjMpoe-yKZV0g-p_ZRpScLLA08LFlMydGpW1mO2uTO9TK1tZkk-jONxq0l4XXqcUAXdjwKsP582jfmV7K/w680/unnamed.webp",
"Description":"A wonderful game in which you will find yourself in the sweet world. It is ruled by different kinds of sweets. The gameplay will allow you to go through quite a few colorful and delicious levels in one go. You may also be pleased with an updated interface and the available game modes. Also, it should be noted that the game belongs to the genre 'three in a row.' So, the more candy you collect the more bonuses you can get.",
"M":"Many Moves",
"Note":"Every Levels Have High Number Of Moves",
"U":"August 7, 2023",
"V":"1.248.1",
"Link":"https://www.mediafire.com/file/ypob3g8dl2qtlna/Candy_Crush_Soda_Saga_1.248.1_Mod_By_Brotherz_Gaming.apk/file",
"Size":"112.92"},

{"Name":"Criminal Case The Conspiracy",
"Category":"Adventure",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg3b2BTHX4KKpXWaNdjCUbtXQcoCayqZxTyfAueq63Xoqw0CRNV_JhHPgLnks3WiW64h0nvRIcygMIQ2Bcoxh3-LhuVun4BQ7KbkZdax4xlH2Z4KXaUj7XsZfTBRpiPGMfn-pl4jlxWcgqhFWpIq6oXfGDZa7OWpzyDNnrvlTCRbTH6Iafmyh0iF6pibg/w680/unnamed%20(5).webp",
"Description":"A criminal quest in which the player will join the team of detectives of the Police Department of the city of Grimsborough. In this place on a regular basis wielded a lot of criminals committing serious crimes. The user will have to investigate all these incidents and find the perpetrators. To do this, traditionally it is necessary to collect evidence and analyze them in the laboratory, as well as to take statements from witnesses, victims and suspects.",
"M":"Unlimited Coins\nUnlimited Energy\nUnlimited Stars",
"U":"June 18, 2023",
"V":"2.39",
"Link":"https://www.mediafire.com/file/o106j9ho9lh1l95/Criminal_Case_-_The_Conspiracy_2.39_Mod_By_Brotherz_Gaming.apk/file",
"Size":"81.61"},

{"Name":"Criminal Case Save The World",
"Category":"Adventure",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjtdZ4iirQvCl4ZJuGn9t8BH3Ad7Jte8g0zqAp3MNM8_3VCmIca-5BNrxEHsK_16Ih868a8SOBP57itkH4kjrhapNCH9TcNYYcigSd5WQoX0AatzLWqU-RPMfW5lHsFTk86fVbxuPn9bkiiq7yz0Wm1FnAN5UeHuGXM1ljfN_XrXmp73LYDX6eubKyWfQ/w680/unnamed%20(6).webp",
"Description":"A detective quest in which the player will join the team of elite investigators who investigate the most complicated cases. The user will be to travel the world and unravel complex crimes based on the evidence and testimony of witnesses. Each investigation will begin with the premise of the scene where you have to find as many leads, and then send them for examination. Having received the opinion of laboratories, interrogating witnesses and comparing the facts, the investigator will be able to calculate the offender and send him behind bars.",
"M":"Unlimited Coins\nUnlimited Energy\nUnlimited Stars",
"U":"June 4, 2023",
"V":"2.39",
"Link":"https://www.mediafire.com/file/yr55l3negzgcdkg/Criminal_Case_Save_The_World_2.39_Mod_By_Brotherz_Gaming.apk/file",
"Size":"74.57"},

{"Name":"Criminal Case Pacific Bay",
"Category":"Adventure",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiMZe-jo_D3a3likWNlc8ByMhgCKUOz7aoCL0hJW3xWQD-BhVY75hnYXq15WNtfjBH3vTUC4SglMWr2FJ9HIGiuXJbaOQSFY3hEcte9EAQcsXtw73qCiM5QxN3qnfctK3rn7bJhKvIQPyXQAx2pVCQZMrG_QyeYrc9BPJ2nMq2oKcFttmFROSXjZe5vfw/w680/unnamed%20(4).webp",
"Description":"A classic detective quest with hidden object, where player will be to investigate crimes together with police from the resort town of Pacific Bay. To find criminals, the user must carefully inspect the scene, finding important clues to analyze data in laboratory as well as to communicate with witnesses and suspects. Properly comparing the received information and facts, the gamer will have the opportunity to trace the attacker and put him behind bars.",
"M":"Unlimited Coins\nUnlimited Energy\nUnlimited Stars",
"U":"June 11, 2023",
"V":"2.39",
"Link":"https://www.mediafire.com/file/w05bnlwxfniyvti/Criminal_Case_-_Pacific_Bay_2.39_Mod_By_Brotherz_Gaming.apk/file",
"Size":"71.70"},

{"Name":"Hitman Sniper",
"Category":"Action",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiYIYkEhUqLOrFaGCaisCRA9jBCPrfiAYSB-RMcg3lwHkIjt-JrEsz0BK5Iq_vLm8G49eyYyxR5T6wgNWoTpQt3gjCD3S_xmna4Ofpn-RC3QneDgsPPM8xG0PlHl-Ruc5CYLjsVWVnpWCU3vETHqtOaP_BNv_EFywMj-tocdIQ7tSaOXlrYVsyar8Xmb0LB/w680/unnamed.webp",
"Description":"Become a real agent 47, sneak and kill silently. Your goal is to kill terrorists and very bad people, complete missions and earn money for new weapons. Do not spare the criminals, do everything carefully, take a comfortable position, track the target and shoot. Go to different parts of the world to complete dangerous and unpredictable missions, one of which is tactical missions in the expanses of Montenegro. Over 250 missions and 10 difficult contracts await you in the game, learn the art of silent killing, improve your own skills and train your shooting skills. Destroy especially dangerous targets, collect weapon parts and open new sniper rifles. You will be available 16 different and dangerous rifles, collect the entire collection and become a professional silent killer.",
"M":"Unlimited Money\nGuns Unlocked",
"U":"July 23, 2023",
"V":"1.7.276729",
"Link":"https://www.mediafire.com/file/4nlqx1lrmkiqooc/Hitman_Sniper_1.7.276729_Mod_By_Brotherz_Gaming.apk/file",
"Size":"854.56"},

{"Name":"Criminal Case Paris",
"Category":"Adventure",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgi0X-v_1Uz0_hq0BNXcPyzoIOjpMxGE0YvXzXxoJiapDFV9z8eZtXrL-P46VqYtCZQ1JV6z4vAkdncDejQxzdjqW5nSLCZKx0xKKaW4QXp9y6MN6BtyfgLpsh4OPcYIcBZdReogA_CGs-cgc7RX6XdlWQUvChqOOSkYHV7qMtM31Wa3SXMAqaRjyRRPA/w680/unnamed%20(3).webp",
"Description":"A classic detective quest in which the player will investigate crime in Paris. The capital of France, despite its romance, is also suffering from the killings and other incidents. To reduce crime can and he will do it by studying the physical evidence at the scene and in the laboratory, as well as through interviews of witnesses and suspects. Comparing the received data, the investigator must accurately identify the perpetrators and put them in jail.",
"M":"Unlimited Coins\nUnlimited Energy\nUnlimited Stars",
"U":"May 27, 2023",
"V":"2.39",
"Link":"https://www.mediafire.com/file/iu2recv17m4qzdu/Criminal_Case_-_Paris_2.39_Mod_By_Brotherz_Gaming.apk/file",
"Size":"79.41"},

{"Name":"Criminal Case Supernatural Investigations",
"Category":"Adventure",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgILWrNXkz3rpqhSQuQz6ZllWL8SGUnRtK7EsSlNCTJDOZeSG-lbav4tb0aonXdO1cZeFljR8nka1L8pSuIwI7W1RwGnv_XdNAyINvePggN0i1zjRVQZsiNIYi51CZZRCB2WIL__SZAhbEXaaAdgQFaP8TlCAXmRpEl-A5EcZUXsje9lK5q5DBS3TmoQA/w680/unnamed%20(2).webp",
"Description":"A detective quest with hidden objects mystical elements, in which the player will investigate crime. Through a careful study of the scene the user should find valuable clues to draw conclusions and to identify the attacker. To inspect be quick, as the time on the timer will inexorably melt at the sight. However, comparing all the facts and found objects, do not jump to conclusions, because the offender may well be smarter and more dangerous than at first glance.",
"M":"Unlimited Coins\nUnlimited Energy\nUnlimited Stars",
"U":"May 20, 2023",
"V":"2.39",
"Link":"https://www.mediafire.com/file/g71nqfd6fft39pj/Criminal_Case_Supernatural_2.39_Mod_By_Brotherz_Gaming.apk/file",
"Size":"71.59"},

{"Name":"Criminal Case Mysteries Of The Past",
"Category":"Adventure",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgPTbqKyN8UdJfeaoiJ611ffJ1E-Mcarx5_DJ_rlGGgBAgyz5TQ9GlzglwanTTvmmpk7NOG4WmuYjNapWpPdIbvNBkoETwFXjhk1krOjmIUDfTFbrV01MP04A-uFwkPsVoEfzTyhDvePSQt8IWfQLr99MTP7LPq_Xl1v1SPkOqngeclrlK7CHlokMxXzw/w680/unnamed.webp",
"Description":"A great detective quest that takes the player to the XIX century. In those days, too, committed many crimes, and several incidents have to unravel to the user. Traditionally, the gamer would be to visit the scene of the crime to find evidence and further study in the laboratory. Also he will have to interrogate witnesses and potential perpetrators, to correlate the information and facts. In the end he will have the chance to bring the perpetrators to justice.",
"M":"Unlimited Coins\nUnlimited Energy\nUnlimited Stars",
"U":"April 2, 2023",
"V":"2.39",
"Link":"https://www.mediafire.com/file/ewnfrik5vfzwbsu/Criminal_Case_Mysteries_Of_The_Past_2.39_Mod_By_Brotherz_Gaming.apk/file",
"Size":"75.99"},

{"Name":"Battle Of Warships",
"Category":"Action",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjOKp8b0Ad47QDtKGwhCD_SpRLh747nJLwuA3brtTpYK38emIjRFPdiK1QEJY7nCzr-FfBl4YQnssUw6MC85CaRC-bqFKm99PRnsYhdKTHmTNjibM6q8TFArUxDrNRW-JSa8Tu_j1S62Ik0B0ZqK1RqgApegCZeCoEigJdIQcItUcNrRSdoYY0FASvLOA/w680/unnamed.webp",
"Description":"A game of naval battles for devices on the Android platform. The gameplay is based on naval battles with ships of the enemy. The user is offered a wide variety of missions. Initially, the player is already available a good cruiser with a decent Arsenal on Board. Torpedoes, naval guns, radar search devices, and much more is on the armament of the ship.\n\nNeedless to say that in the process of passing the need to upgrade as the ship and its Arsenal. Victory in battle is given some amount of game currency. With due diligence you can save a considerable amount that should be spent on the modernization of the cruiser. You can also use real money, so quickly to buy the necessary improvements. The game features excellent graphics.\n\nThe developers really tried detailing every element of the ships and making great animation. The atmosphere of sea battles also supports the gorgeous music and sound effects. Battle of Warships is a game, which will appeal to all fans of military battles.",
"M":"Unlimited Dollars\nUnlimited Gold\nUnlimited Platinum\nUnlimited Torpedoes\nUnlimited Interceptors\nUnlimited Aircraft Carriers\nNo Reload For Weapons\nRapid Fire For Torepedoes\nGodmode For Aircraft Carriers\nPurchase Do Not Require Levels\nNo Ads\nAnti Ban",
"U":"May 8, 2023",
"V":"1.72.12",
"Link":"https://www.mediafire.com/file/0vpsqoaln7wnpt2/Battle_Of_Warships_1.72.12_Mod_By_Brotherz_Gaming.apk/file",
"Size":"125.56"},

{"Name":"Criminal Case Travel In Time",
"Category":"Adventure",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEikf_WxRhplgsT6I5gq7VsRyN8IV2eYmAd3DdOipMmwnR1jhTQo9MPmo_FbxAigaC5iqHyh_QUmUTXKeQFvyPHYTWK1jsFLXNCvFXfD0saAJtkqJJg_Xp1Iv1am5ZWCNmnGvNQSWJ14aMs8iPoBQGzv_qVWYve12sOnqIYw_-KLStJNxKj-JBejXIIJ2A/w680/unnamed%20(1).webp",
"Description":"A fantastic detective quest with quest items, in which the player along with the team of heroes will travel through various time periods and to solve crimes. In the process of passing the user will visit both in the present and earlier time. For each temporary location he will look for clues, interrogate suspects and witnesses and analyze the information received. The game has excellent graphics, detailed places of action and an interesting plot.",
"M":"Unlimited Coins\nUnlimited Energy\nUnlimited Stars",
"U":"March 22, 2023",
"V":"2.39",
"Link":"https://www.mediafire.com/file/ndtn0w5kmdhnwuh/Criminal_Case_Travel_In_Time_2.39_Mod_By_Brotherz_Gaming.apk/file",
"Size":"77.1"},

{"Name":"Iron Marines",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgqYe3F2ss72I8IRM8hoA4l7Gzm_p_ma_FLwI7wwtLnk9DYVvfEYLIHAJ34SZKzu4gORwJ1KzWrhm4WdCF5XDuCvDUwZKZtCsLMujOs6AL8yPxzz21fI-1LGaImoka3fyMmQcrFPG21Zru0g5BXT1ggPLOaYQ-cCGQVrL5-5mVIlCSqpKFUOpbC5bQ2Nw/w680/unnamed.webp",
"Description":" A large scale military strategy game for Android devices. In it the player will have a uncharted planet on which to rebuild a military base. There will be many missions associated with the destruction of alien enemies. For successful warfare must not only recruit and train soldiers and build defensive structures and guns. In addition, you must develop a base, develop strategies and sending troops to battles with huge monsters that can wipe you from the face of the planet, with all traces of human stay.",
"M":"Unlimited Money\nUnlimited Research Points",
"U":"August 7, 2023",
"V":"1.8.3",
"Link":"https://www.mediafire.com/file/l9upy17zo4ib3uu/Iron_Marines_1.8.3_Mod_By_Brotherz_Gaming.apk/file",
"Size":"669.06"},

{"Name":"Special Forces Group 2",
"Category":"Action",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjTOJWUPYY-aM3ZPFCiHRhl0qRZ8H2pzeHjySefvW67kagQ8GE1ERF2l4akF_XBYK9I3jwUtU-csJYDeclyh-bGwMxHhJw39rlxew4ikdFonEv4eGLlHHvzmYQ-sGySq0303vVtnBX0hnj2qNY-4aeWgTou_T4_Wvsk_ivtNn1gGFvn4ZNZ0EbdG_GhaQ/w680/unnamed.webp",
"Description":"A first person shooter made on the patterns of the famous Counter Strike. In single mode, you can run on the available locations in one of the groups. The classic battle is a battle between two teams that need to destroy each other.\n\nIn the bomb installation mode, one of the teams should activate an explosive device, and the other should prevent them from doing so. There is also a seizure of the flag and zombie mode, designed to diversify the gameplay. Each killed enemy brings in a piggy bank a certain amount of money that can be spent on buying weapons at the beginning of the next round.\n\nAI is quite good here, especially at a high level of complexity. Having enough training on computer opponents, it is worth going to battles with real players. It is possible to create your own shootout, and join the already happening. Special Forces Group 2 is a great action game with beautiful graphics, realistic sound and exciting gameplay. It will definitely appeal to fans of multiplayer battles.",
"M":"Unlimited Money",
"Note":"Buy A Weapon Or Item In Battle To Get A Lot Of Money",
"U":"March 12, 2023",
"V":"4.21",
"Link":"https://www.mediafire.com/file/bdizbno4zdlei12/Special_Forces_Group_2_4.21_Mod_By_Brotherz_Gaming.apk/file",
"Size":"311.16"},

{"Name":"Cover Fire",
"Category":"Action",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjXkawTHZsJ_RTgy4e1Zn8GNRQD9ZgNoKo_BdeoUCsQLUP0zCWA9QJXlU5DgNgF6f5CC5FEEzupMxYLWW2NKE891OK12VP1VK1DbkfLBj2Pych8htbFYaXuLbM0EstXHjVF8w_VyEUM4ZcpBHQg_YfnXBfisb7enpKp_8vPD3zdw7FN092PpMwKpGC9hw/w680/unnamed%20(1).webp",
"Description":"An excellent realistic shooter game in which the player will assemble a team of specialized soldiers and fight with Tetracorp. In the first mission under the user's control will be the shooter, armed with automatic rifle. Need using cover, destroy the enemy forces. In each mission you can get from 1 to 3 stars rating. To get the maximum amount necessary to perform a number of additional conditions.\n\nThis may be committing a couple of shots to the head or the elimination of enemies with a single clip. The missions will culminate in gaining experience points and game currency. Also, the player is given the case, revealing that you can get different upgrades and new fighters. So a team can be replenished with a sniper, to cover for colleagues off the roof, or a demolition expert, specializing in explosives.\n\nThe game has good graphics and animations, and destructible environments. The management here is easy, you need only accuracy and aim to shoot, move the same automatically. Cover Fire is a great example of a realistic shooter game that will appeal to all fans of the genre.",
"M":"Unlimited Cash\nUnlimited Gold\nVip 5 Unlocked",
"U":"August 7, 2023",
"V":"1.24.06",
"Link":"https://www.mediafire.com/file/jvbk8nhuzvf7ub1/Cover_Fire_1.24.06_Mod_By_Brotherz_Gaming.apk/file",
"Size":"336.35"},

{"Name":"Magic Rampage",
"Category":"Action",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi0N64PyWymD6EDSX23TyhP7TLPACdmMlBi1RDdboG3_Bs-jtmlM2cxyxbgck-CljcXydtIKwDQAxmfPK6XnwzyNyR8nZB9-E2AFrevBJ3N5N29FOJHwKyTfUqXX8KSOXKRPJsBBPyS9QquKv7mmRpewffZGV_s7IzElDZ9scTuuxLBLm-dGkQqVMUqyA/w680/unnamed%20(1).webp",
"Description":"The game is in the genre of platforming with RPG elements, which takes place in a parallel universe under the power of ancient magical powers. In the story, by one of the seven heroes, the player is sent to gloomy dungeons to fight an ancient evil. Each character has their story, skills, weapons and equipment, so you should choose a character that best fits the style of a user.\n\nLocations are crawling with demons, the undead, skeletons, destruction of which will have to do. As you progress you will accumulate experience points and game money which can improve abilities of your character, buy new weapons and items. Also in dungeons there are secret places that hid the blue crystals. These items are spent on the discovery of additional levels, so you should try to find them.\n\nGraphic design in the game at the highest level. High quality drawing locations and high quality animation and pleasure from passing. And frightening sound effects induce fear and work for the dark atmosphere. Magic Rampage is a quality RPG platformer, which is one of the best representatives of the genre.",
"M":"Unlimited Coins",
"U":"August 7, 2023",
"V":"5.9.3",
"Link":"https://www.mediafire.com/file/5452umch8ra05q9/Magic_Rampage_5.9.3_Mod_By_Brotherz_Gaming.apk/file",
"Size":"140.21",
"Note":"Sell a health potion to get a lot of money."},

{"Name":"Anger Of Stick 5",
"Category":"Action",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj55mSBWTmQbJUzYZIsGo3hKcujDpc_Q0LsPJvTPzRYWjAlyflwAiyRlXOimWf-ymmTIUiBF3QYV7itZ5tNp6Rh6W03JzvBjpl2OEywBLF06fT5eqMmhZbt27g4NOR6eBrnUtGiGPFod3UeVJ0Ws8Ujgbb214Xy-nJyWZ6g5PlAu7v_xDnDGIIpSjjilA/w680/unnamed.webp",
"Description":"One of the most popular series of games about Stickman. The user have to face many civilians, who became zombies. In a thin person will have a vast Arsenal of means of destruction and fists. During gameplay, the player will meet a crowd of walking dead, as well as non-infected population in need of assistance. Fight through hordes of enemies alone or in the company of six of the allies, ready to cover his back and fight shoulder to shoulder.",
"Pkg":"jpark.AOS5",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"1.1.83",
"Link":"https://www.mediafire.com/file/wj6b2rkf4kiw9d4/Anger_Of_Stick_5_1.1.83_Mod_By_Brotherz_Gaming.apk/file",
"Size":"49.34"},

{"Name":"Shadow Fight 2 : Special Edition",
"Category":"Action",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgjYfjEj0hCIR4CIfsUPMzuzIhKdfdEKBrSK_FqrdgTg5ql9nvdBZjHQ-JF3DI3nH6GlgGhIRoGTNTibSAmnYhozg5Hfi2qGWSMGr9StvX6vLVgo6kYmy1-WEZG35YLDwSLSHOzO-Qb5re1xLWuP60DhdJ_ReKV0HdK2sxxVBJy_gX3YSxoEPURFmb_ZA/w680/unnamed.webp",
"Description":"A new version of the second part of the famous fighting game. The developers of the studio Nekki decided to remove all the flaws and transform the favorite game of many. First of all, the absence of energy, which was spent on conducting fights, is striking. This should really please the users, because now you do not need to wait for its recovery. Also annoying ads were cut out here, which is also nice.\n\nThe rest of the dramatic changes here a bit. Were added several types of weapons and ammunition, as well as one story chapter. The gameplay has not changed, it's all the same kind of furious action with RPG elements. Throughout the campaign, you need to pump a fighter and defeat all bosses with their own fighting style and weapons.\n\nShadow Fight 2 Special Edition is an example of how to get rid of the shortcomings and increase the advantages of the original. The game will surely please fans of the series and just fans of quality fighting games.",
"Note":"Run the game after installing and play till the tutorial screen appears, now close the game and clear the game data once and run the game again. The game will take some time to load when you run the game after clearing data, do not close the game until it finishes loading.",
"Pkg":"com.nekki.shadowfight2.paid",
"M":"Unlimited Coins\nUnlimited Gems\nUnlimited Orbs\nAll Equipment Unlocked\nMax Level\n0% Progress",
"U":"January 4, 2023",
"V":"1.0.10",
"Link":"https://www.mediafire.com/file/5txntw72dbqye5r/Shadow_Fight_2_Special_Edition_1.0.10_Mod_By_Brotherz_Gaming.apk/file",
"Size":"394.48"},

{"Name":"Stickman Legends : Shadow Fight",
"Category":"Action",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiy7yQiCJ5pdn7_aDvKVcjDKY4QnatlzMeX-SVmQmpr4-Kha7kwVYX-4Ne9eDoY6qNMF8VuVJYceQK5Hg7xFWpVUb4WtSaaojkX7eCcKD3SQ3LzN9uCQ2Fs1XYZ1Gc_uaHTq-Kf3H_r20mLYLOZKFpmbMyQB3Ewr7dVgWi40W1ItyBpyhm5rl7zYFpVVw/w680/1638431508_1.webp",
"Description":"A horizontal action game in the best traditions of this game segment. The plot here is weak, and nothing particularly new to the industry does not bring, however, you should look into the gameplay itself.\n\nIn the story of the forces of evil break loose and start to commit outrages on the home planet of the main character. People had totally lost any hope, but at the other end of the map is the settlement of the brave men who from childhood was trained to protect people. To fight against the Evil went young, but skilled enough warrior Shido.\n\nThis character you will control. Game mechanics are built of the already well known scheme. However, the creators of the game still tried to make the gameplay as varied as possible, adding more number of different kinds of swords and other attributes.",
"Pkg":"com.zitga.ninja.stickman.legends",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"4.1.4",
"Link":"https://www.mediafire.com/file/07yfp3hjsy1yhae/Stickman_Legends_4.1.4_Mod_By_Brotherz_Gaming.apk/file",
"Size":"138.09"},

{"Name":"Robbery Bob 2 : Double Trouble",
"Category":"Action",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEgj536hdjnJWaaFjZYGpDRLFlv_G9LmRJlaUYVrNTd6LMuWPlscyL0SO0vF2qa4OMMfB9haAgp2AOFbApxvVCg5fKkPxVrqf2DzdSF1Xx2fI7_PXR8HKT1jtRBfcO8Zj44Q1RBq4gN0Q3ZLsFKh8NrJcfK6k6fN-vL_PcR6Wp0TkgoygWtE2mw2UFjWLQ=w680",
"Description":"The second part of the adventures of the hapless thief. The main character Bob owes a local man a tidy sum. Not finding such in his wallet, he is forced to carry out orders of a mafia boss.\n\nThroughout the game the user will perform fun tasks. For this you need to sneak into houses and steal necessary items. But this is not so easy, because each mission threatens to become disastrous due to various traps. Thieves committing the acts necessary to guard against hidden cameras and guard dogs. If the hero gets into the lens or into the eyes of a dog, an alarm is triggered, then we must act even faster.\n\nAlso on the way the hero will be the massive door, moving the flooring and attentive grandmother trying to catch a thief. To cope with emerging challenges will help the various items that distract attention to themselves. Robbery Bob 2 : Double Trouble is an interesting arcade game, not devoid of humor and is able to thoroughly entertain any player.",
"Pkg":"com.chillingo.robberybob2.android.gplay",
"M":"Unlimited Coins",
"U":"August 7, 2023",
"V":"1.9.8",
"Link":"https://www.mediafire.com/file/faehdqrmsndaeav/Robbery_Bob_2_1.9.8_Mod_By_Brotherz_Gaming.apk/file",
"Size":"80.82"},

{"Name":"Roberry Bob",
"Category":"Action",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEi8Gi7XHH3YwHZj1J3bSN0_hKg79RjmEu0r07C7oxdWGgWVktFPulM3Gu-54yVArdn-c2kARcXpBS8Mv4_7-FuXDKNi7sJ81NHpnNeeHdOaMrio8Any7kC_iOz5uRA5reS5tbUSKp2cv5dbyAKa89gMqhBOF862vN_iVubTHtYIa6KOmj8r4DDIuxvAnw=w680",
"Description":"Adventure arcade game with elements of puzzle and stealth, telling about the thief Bob. The main character had recently left the prison walls, which contributed to one businessman. But for freedom you have to pay, and now he works for the man, robbing him of the house of the rich.\n\nThe gameplay combines elements of puzzle games and stealth action. The character you want to secretly sneak into expensive houses and carry out all values. In each new level you need to Rob a new home. This is not to catch the eye of the inhabitants, otherwise they will call the police and chances of passing will go down significantly. As you progress through the hero will gain new abilities and devices. Also there are added new traps and hiding place.\n\nThe project has been optimized for all Android devices graphics. The control is implemented conveniently. And nice soundtrack creates adventurous atmosphere. Robbery Rob is a fun arcade game that will appeal to fans of the genre.",
"Pkg":"com.chillingo.robberybobfree.android.row",
"M":"Unlimited Coins",
"U":"August 7, 2023",
"V":"1.21.0",
"Link":"https://www.mediafire.com/file/0x9fqv0j6gdg6lr/Robbery_Bob_1.21.10_Mod_By_Brotherz_Gaming.apk/file",
"Size":"60.17"},

{"Name":"Shadow Of Death : Dark Knight",
"Category":"Action",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEhVd0eEjMpnr-LFZ3F3HeYQko4vNBPpS-ycFaG6OJw4MTOzfbpkDpuD1OojIMrGw6j6e1h9web3jA2_Eoe0rgOrG7k345OLBIXDDtFJfXEM7m6zKHBK7fs99ZGzUFWGWs6dALp3W6wRS55unxYK5xOHO2_yYzF40LU89OeFHqrg94ILYWBlMCmnuvC_GA=w680",
"Description":"Shadow of Death : Dark Knight is an action game, which will send the player into a dark world stands on the verge of destruction due to the activities of the monsters. The protagonist is a powerful knight, tasked to destroy the monster that destroyed the Kingdom and intending to do this with everything else. In the process of passing a character using the powerful weapons and skills of the warrior can defeat the enemy. Impressive battles, quality graphics and easy control will help you to get pleasure from the gameplay.",
"Pkg":"com.Zonmob.ShadowofDeath.FightingGames",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"1.102.9.1",
"Link":"https://www.mediafire.com/file/47wm3nl7qp602ac/Shadow_Of_Death_Dark_Knight_1.102.9.1_Mod_By_Brotherz_Gaming.apk/file",
"Size":"191.64"},

{"Name":"Soul Knight",
"Category":"Action",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhOs19bxfqUbGctpm_JXWRkJMtpdw9YqmKdF3pqMo6ruCGv-lQjVmvobHLNOhwQrxm5ytD8VerLhemfP4FyVkjpy3U415Q5WMFLgq9Stx502kzGMB7rzmsqWfn1y_X0dCw_ov-eGopgTU7X5_KvZ_k140e3WMe4Fy1xCW19W7Dz1BwYnb56z38-EJZTqw/w680/unnamed.webp",
"Description":"A shooter, narrating about the confrontation of people and aliens. The aliens have stolen an important artifact from the earth, as a result of which the fate of the whole world hangs in the balance. Only a handful of heroes can turn everything back and return the hope of salvation. For one of these characters and have to play the user. There are more than a hundred types of weapons, with the help of which it is necessary to engage in the extermination of hordes of foes. The standard mechanics of the shooter is complemented by pixel graphics and the system of pumping the character.",
"Pkg":"com.ChillyRoom.DungeonShooter",
"M":"Unlimited Gems",
"U":"August 7, 2023",
"V":"5.3.2",
"Link":"https://www.mediafire.com/file/ux4ppffwchmywcb/Soul_Knight_5.3.2_Mod_By_Brotherz_Gaming.apk/file",
"Size":"756.18"},

{"Name":"Zombie Catchers",
"Category":"Action",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEjzmZVRqaag2aWOkKNrMcZu4osSAIlEU0BhJznc0ALRwjGKLkxnDLHQxx8iHSenKlbYMZwbWI72NnhUpXA5IO18jyvik5vck-YwhAUeZ2oWeE9vbgkr69vk-HkKBs1_rb6xlsAO3Vj-GvQSImemGhYNvWApFBzRqp-EetjzJsiKCQiEs6CW9N8q_jEC8A=w680",
"Description":"Entertaining arcade game with custom games zombie-themed storyline. The protagonist of the story is the messenger of another planet AJ. With his friend, he decides to build a business to catch the living dead, which is teeming with the planet Earth. The job is well paid, so the characters are smart and perform this dangerous job.\n\nThe main task of the player is to find as many zombies as possible. To perform it, you need to use a variety of traps, such as nets, harpoons and other devices. For a successful hunt will also need a bait, which should bite the living dead. After catching a few copies they need to be delivered to the base, where zombies are processed into a variety of products, the sale of which and earn heroes. The money can be spent on improving hunting tools.\n\nAs you progress to success on the way characters will come across a variety of types of the living dead from harmless to armed to the teeth. Also at some point there will be storks, bats and crabs, who will try to prevent the fishing of alien businessmen, so you should be prepared for such a turn of events. Zombie Catchers is a non trivial game that is ironic over the projects of zombie themes and will appeal to fans of unusual arcades.",
"Pkg":"ft.twomenandadog.zombiecatchers",
"M":"Unlimited Coins\nUnlimited Plutonium",
"U":"August 7, 2023",
"V":"1.32.3",
"Link":"https://www.mediafire.com/file/tpnq1vxi0phazwv/Zombie_Catchers_1.32.3_Mod_By_Brotherz_Gaming.apk/file",
"Size":"85.03"},

{"Name":"Alto's Adventure",
"Category":"Action",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEj8zZrYprvNLYDp-UZShgQ-ZaQleHbfasnLXTGZcPeKpq6VQJJ6rH48L45_2wngLox80eqj3ojFfKfA_FspuJ3mzrQQJxvpHKpZz73xwqwtfjCl8vZXeFvrTjjnEqEu-xLhhjy7EyKS5outqmc75VW8tilhXH0xZeACUmcBXHQCyisyvizVbterzDmOQQ=w680",
"Description":"Very interesting, and bewitching game. Which from the first minutes of the game, will dip you into a mysterious and exciting world. The essence of the game is to catch up with all the deer and lamas that have fled from your farm. Ride on a snowboard and collect coins at the same time, for which you can discover new types of heroes and improve their characteristics. Incredibly beautiful and enchanting landscapes in Alto Adventure mod apk, with pleasant and unobtrusive musical accompaniment, guarantees you a lot of positive emotions. Do daily tasks and increase your level.",
"Pkg":"com.noodlecake.altosadventure",
"M":"Unlimited Coins",
"U":"August 7, 2023",
"V":"1.8.12",
"Link":"https://www.mediafire.com/file/id4e1w4idozzups/Altos_Adventure_1.8.12_Mod_By_Brotherz_Gaming.apk/file",
"Size":"74.99"},

{"Name":"Criminal Case",
"Category":"Adventure",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEijgvIx60JdP9q5BKp-SNvDI_tVmxUG9zjDXwGZypLprIDi51C--8hDGM7rhNjZ3OGihI0jjUw6Z7x4_-_VKdtbM7EQW-XSZ9u2GoAsGjceb29AnERw51IoOghlF3bE0Y9mNyIacwTZUfZ2_Q0oL6RinCZeL084xPzdwe8Y8a7UAvmG3VMIWjxpuPfHMA/w680/1562390992_1.webp",
"Description":"A criminal quest asks the player to become a real police detective. Dark metropolis was a place of brutal killings, and corrupt government strongly impede the investigation. The user will take control of the unraveling of complex criminal offences. For this he needs to look for clues at the scene, interrogate witnesses and suspects, and solve puzzles. All this will help to find the culprit and put him behind bars.",
"M":"Unlimited Energy\nUnlimited Coins\nUnlimited Stars",
"U":"January 4, 2023",
"V":"2.39",
"Link":"https://www.mediafire.com/file/ua1qwy6p06v1c8t/Criminal_Case_2.39_Mod_By_Brotherz_Gaming.apk/file",
"Size":"66.23"},

{"Name":"Ninja Arashi 2",
"Category":"Adventure",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEhWwrmaMtg0-OgMFJQl2z0gIGjYP1lwDN-DryuSzhTEmu9_hatUrYVNoSDer9wsN0lcWXMRoVRXfFLTFm39liN-cpc6XyHY_z850uWb_kYs5UcghdSTgyqctzWeOvxDQHht4hT5xJHAQH7Rh2ml--6OBeKeqBRoWz9E0b2iqNptbadxQd-dKn9LWbvsjA=w680",
"Description":"Sequel to action-adventure about a ninja warrior who needs to save his son from the clutches of the demonic creatures. In the first part the main character managed to escape from prison, and now his task - to win the offspring. To do this, it will go a long campaign, during which he will enter into a fierce battle with the minions of the villain. Overcome more than 80 levels, the character will be able to complete the mission, fought with the demon and rescue my son.",
"M":"Unlimited Money (Increase When Spent)",
"U":"January 4, 2023",
"V":"1.4.1",
"Link":"https://www.mediafire.com/file/31bgpjrfi2r9uy4/Ninja_Arashi_2_1.4.1_Mod_By_Brotherz_Gaming.apk/file",
"Size":"145.51"},

{"Name":"Ninja Arashi",
"Category":"Adventure",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEjKSHYPFh7nJh3WoMhcNrcQt_Bo8zsBFCVbmsYXmDGtOFuc_IytwdUb0JU_-cnwjqxdihQ6lgZjUi9qN5oVF9jLjbZx9ADA_X0tYdSYiut-qapUHY2cg1N07wx2KM6n6XTZt3KmciIzfCx5YyLUnAeg0IGYhVaSrNZLdDp01d7bB72kBCbgLTjaVNxq0w=w680",
"Description":"Platform game tells about a ninja warrior who went to rescue his son from the hands of the devil himself. For that he has done the hard path full of traps and enemies. For adventure samurai will jump over pits containing toxic liquids and spikes, and also chop enemies in the cabbage with the help of a trusty katana and shuriken. The game has excellent graphics component, great gameplay and lots of improvements to weapons, allowing an even more efficient way to fight the apostates.",
"M":"Unlimited Money",
"U":"January 4, 2023",
"V":"1.6",
"Link":"https://www.mediafire.com/file/miuermj5uhza3nd/Ninja_Arashi_1.6_Mod_By_Brotherz_Gaming.apk/file",
"Size":"71.2"},

{"Name":"Sqube Darkness",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhjDn6hMo9VVg0QtmrcpdHxqnkKYJMtiitp_tpeXYV4B2fMKfFBa563E6XbQYk_XKJXrkwJRnhyB6nuhzWkyOlPmHeX3BlYnKJPUTokYirzwOHAM61Xz8pZClz8rWURDC5KEvWIaelzTkk6LxLr4XHdnDUw6UXXe4vDV_DFC7tNhlKsOUwYGuuhqbgtLg/w680/unnamed.webp",
"Description":"Sqube Darkness is a platformer geometry cube game with dangerous enemies and hard obstacles. Players use their reflexes to jump and run at the correct moments to escape from the attacks of the Eyes. Running games are quite popular, but Sqube Darkness doesn’t follow the geometry formula used by other kinds of freeballgames. There is a vast array of unique levels and you will never get tired of run and jump action.\n\nPlayers can use swipe or on-screen button controls to run and jump. This freerun game is truly free and all cubes can feel block jumping however they like. As a game with beautiful geometry shapes and geometry dashes, you will always feel sharp!\n\nEach temple running gives you stat points to develop your heroic cube character. Buy boosters and increase stats to run and jump better and faster. As a free run cube, you will always find something to improve with your geometry cube character.\n\nSet a high score and compare yourself against the other players in the world. Subway surfing might be good at this game, but you can prove to be better at run and jump action. Control your geometry cube perfectly to get into the top spots!",
"M":"Unlimited Cube Points\nNo Ads Pack Purchased",
"U":"August 7, 2023",
"V":"3.1.4",
"Link":"https://www.mediafire.com/file/grysjt5dxlbznho/Sqube_Darkness_3.1.4_Mod_By_Brotherz_Gaming.apk/file",
"Size":"95.64"},


{"Name":"Samurai 2 : Vengeance",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhuPl_xIq1atqt8YnGYi5I7Csn43O_1j8uBRiiru_upc9cLNN56pUKDTE8FOc8AJXnPItI56ku0oYOO62SPd0EY1lqUOL_qbxodmLNMSzNMwKagsMKHY0S51-ICe0Sfnrc-ln8V4dBMJg1ogja9yvKh1GakvG3GUWIJrdRDtYe1JEnmzOAbCdu2EOA2hQ/w680/unnamed.webp",
"Description":"Continuation of a great action RPG about a vengeful samurai who seeks justice. Compared to the original game received a much more convenient operation, improved graphics, new modes and improved artificial intelligence opponents. In the story the main character Daisuke is on a quest for revenge across the war-scorched countryside. From a seafaring village to a flying fortress to the legendary Isle of the Dead, the samurai will stop at nothing to hunt down his arch-enemy Orochi. Will he get his Vengeance?",
"M":"Unlimited Karma Coins",
"U":"August 7, 2023",
"V":"1.5.0",
"Link":"https://www.mediafire.com/file/7x9uexq6h1bo1vu/Samurai_2_Vengeance_1.5.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"52.86"},

{"Name":"Rail Rush",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjEaw6OX4UAtvtkZa1h0wSMTC4Qi_XVoY_4aWRwS19JMQ5aHRdd9L-AOVARWEiaKSvwZSO7NbPgrm4Nfhqt9Zk-YenB5QxFQVFPAOYAElEn1_XlET8JMet2ypddL-s9UtqCinDU1Uxczl3y1CNFNvTQVcsbUl2ViYnYgP8Dcr1fA6Cj7ehIHEBxCyp9eg/w680/unnamed%20(2).webp",
"Description":"Rail Rush is a high quality arcade game for Android in which the main character rushes through the caves in the cart, collecting treasures.\n\nAt the beginning of the passage the user will go through a brief training manual that shows the basics of gameplay. As a runner, Dolly the main character continuously moves forward. On the way, according to tradition, will encounter various obstacles that you can jump over or pass under them. From time to time railway is cut off, and not to fall in cliff, be on the adjacent track.\n\nRail Rush earned gold and crystals to spend on purchasing the in game store, where you can truck, new characters and various bonuses and improvements. Thus, it is possible to buy so called 'second chance' which allows to continue the race even after the crash. Pleased with the variety of locations that you can unlock by completing certain tasks.\n\nManagement in the game by all possible ways. To collect treasure, you need to tilt the device in hand, leveraging the gyroscope. To move from one track to another using a horizontal swipe to jump or sit-ups-vertical. In General, the control is implemented is difficult, and to get used to it will take some time. Summing up, it should be said that Rail Rush is an interesting and fun runner for Android, which will surely attract fans of this genre with colorful graphics and a variety of levels.",
"M":"Unlimited Nuggets\nUnlimited Pass Tickets",
"U":"January 5, 2023",
"V":"1.9.19",
"Link":"https://www.mediafire.com/file/gcvepy3dgaha9h0/Rail_Rush_1.9.19_Mod_By_Brotherz_Gaming.apk/file",
"Size":"49.06"},

{"Name":"Tank Stars",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEhmNzAxCFFAj8yAYHRRnqdiIktwnmOE0HtcDqhy6ltx9zAn9UucCy-5eRae1L54LvdUqQPQwPdRFz9MlFWUFxubVqloqJIfKOaBug4emsaxMc1aeNj9CNTds2CYlB7AXYC6OU9hK2sKDLzoaoVGXx5sFIZh2VHIIS2lICZM_Bh-ohOm6drqVSo3R4gj1Q=w680",
"Description":"Arcade game, offering the player to participate in tank duels. Driving a caterpillar machine, the user will try to destroy equipment of the enemy with accurate shots from a gun. For hitting the target it is necessary to follow the trajectory of the projectile, so before the shot to direct the cannon at the correct angle. During the game, gamers will be able to access new techniques with unique weapons. Also here you can challenge real opponents from around the world.",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"1.81",
"Link":"https://www.mediafire.com/file/izyq5ecxc67wmfn/Tank_Stars_1.81_Mod_By_Brotherz_Gaming.apk/file",
"Size":"132.51"},

{"Name":"Kick The Buddy Remastered",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEhOQVhLJYfP_Tyzv1FPD2BtqtAXBaEbJp9WjksKfykSqOiy72pbdhCBUTVGqiGnWIYNy-4DQpuAnIVPaLXfca4F5RosQGmJwzW5CuUy01V14wyUPDkRJOB_jwTPXSMh-y2_BJjyEBSbvtyy2zeTJ5M0XS43xERz0nGriLvvP6YWY_sspam2e3dd1KiV4Q=w680",
"Description":"A reissue of a fun arcade anti-stress toy for Android. This project is designed to help any player to let off steam and accumulated anger with the help of bullying the smiling main character. The rag doll Buddy is specially created so that the user can properly come off, and for this he will have a lot of different items, ranging from firearms to magical abilities. Using all the available arsenal, the gamer will definitely forget about the problems and have fun.",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"1.7.1",
"Link":"https://www.mediafire.com/file/2qjnooqusf8diqz/Kick_The_Buddy_1.7.1_Mod_By_Brotherz_Gaming.apk/file",
"Size":"118.52"},

{"Name":"Fruit Ninja",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEghcAwQInxZQKjFgNhEflLPelGJ4NK0zceFx7mPoQco3QTvIUvu2-K8u2rDd_ywU9GwFhBxc37WzCFZpOAsyylZouM2U4TqNT8fKD3HB5_aYF0dCvDG5ymPO9x-W_ZDWt_U4IRDzR9mzz99F8l6GXnbuCRR_XurUk2o5wqBNoSoFlMNI3tOs0AsGB_aIw=w680",
"Description":"Fruit Ninja is undoubtedly one of the most recognizable games on Android. Since the release of the app in 2011, it tried more than 50 million users from all corners of our planet. The program is often mentioned in the parody, TV programs and various jokes. Our hero, as the name implies, is a nameless ninja, who decided to use their skills for peaceful purposes. You have to cut the fruit appearing on the display. The gamer can manifest itself in several types of games - classic, arcade, online mode and so called Zen mode.\n\nIn the classics, the player has three lives, which are lost if the fruit touches the floor. From time to time appear in the sky the bombs. They must be avoided, otherwise the level will have to reboot. You can cut the fruit as one finger or more, depending on how the user would prefer. For slicing multiple products with one blow accrued more points. After a hundred fruit give the player a bonus life.\n\nIn the arcade mode your task is different. Bombs don't kill you but deprive you of a dozen points. Drop the fruit on the floor also does not entail serious consequences. The gamer is required to chop as many products as possible in sixty seconds. At the end materializes grenades. It is necessary to violently hack to buy much more points.\n\nFruit Ninja in Zen mode offers selflessly to chop the ingredients, removing all the unpleasant conventions (bombs and fines for fall), except for restrictions under 90 seconds. This type of game is perfect for competition with friends. The acquired points can be spent on improvements.\n\nThe developers have added a network mode in which your fruits are designated in one color, and the fruit of your opponent – to others. Possible game on a single display that is divided in half. Fruit Ninja won a well deserved popularity thanks to exciting and thoughtful gameplay.",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"3.36.0",
"Link":"https://www.mediafire.com/file/mey0mw89ogla7ek/Fruit_Ninja_v3.36.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"137.82"},

{"Name":"Cooking Fever",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEjkcNjSi3bUNOAid3kyK_P6Mzp5OJndmPOHT2GPxRBdy2B45xBCzmHezWrb7Ks3bGiGTBNI9-o70r1HOarcRnDpp-30Nku1dzvD0ZHQ0zWinOCkAvelCZdEuNAI4S0OSgAHGSM5a9FmUj8Kc10lL4--9i38iybkHSkYzz_Ch1HcvWOwfc6nUnTyGbckYw=w680",
"Description":"An entertaining arcade game in which the user will try on a virtual apron and learn to cook a variety of dishes. The gameplay is based on cooking a variety of dishes for the customers of expensive restaurants and small cafes. The chef will be available to many ingredients and need to create culinary masterpieces. As in these catering establishments then you need to meet at a certain time, otherwise guests will get tired of waiting and will go to satisfy their hunger in other places.\n\nInitially the menu will be limited to simple dishes like burgers and soda. But in the process of passing the player will learn to cook more complex culinary masterpieces. Also have to take care not only about the quality of the food, but also to build your restaurant, buying new equipment and developing the design of the room. So it is possible to make your institution a Chinese restaurant, a sushi bar or a French restaurant.\n\nAddictive gameplay adds great graphics. Elaborate kitchen in which every object drawn. Realism adds to the view from behind the bar, allowing you to look around the room with the guests. Depending on the orientation of the institution plays in the background music of a particular genre. Cooking Fever is one of the best arcade games, tells about the work of a chef with excellent gameplay, able to lure for a long time.",
"M":"Unlimited Coins\nUnlimited Gems",
"U":"August 7, 2023",
"V":"19.0.0",
"Link":"https://www.mediafire.com/file/le7ydc4636q4r3h/Cooking_Fever_19.0.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"161.34"},

{"Name":"Dan The Man : Action Platformer",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjKRw6_IulMcdR3CE5uvy7xM4-us5i9oUmJ55yOLMQXxH0Z1cmHT8Mg5jZzRUUkJUrDhsXsJNCGhsMKjf-M3WcQHz-8PR20sqcNfAfwFt4ICCfOSQlPN2JH2oajMXhm9rKG8wQ9zf_AW3iDqCb3oUV86EGNXwKfAUICiIKVDcpvENOTmbBAkmo1wQKy3Q/w680/unnamed%20(5).webp",
"Description":"A pixel platformer whose protagonist is trying to protect your village from the attacks of the enemies and simultaneously looks for his beloved. The game has many levels on which character will meet with a bunch of enemies. To destroy them will be using a variety of weapons: pistols, submachine guns, granatomyot. In addition, you need to look for secret locations where treasures. The game has excellent gameplay and will appeal to fans of old-school projects.",
"M":"Unlimited Money\nVip Unlocked",
"U":"August 7, 2023",
"V":"1.11.22",
"Link":"https://www.mediafire.com/file/ajr0wqf3n21pose/Dan_The_Man_1.11.22_Mod_By_Brotherz_Gaming.apk/file",
"Size":"95.34",
"Note":"Play Only Without Internet Connection"},

{"Name":"Temple Run",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEiXi17OScwPWap35RpNgRckDv5lFHaOAF-dSb669a8lWMAnkHQukXe3r26SmHI4VLMlTplXpRuER8yZbKD9ZGs6v7nGOUrbzG7-rxiU4Ydlwa4oCTfO39h-_l-tmN_TUuHAgKn4saTy4DYluTaOKhTvy5GyKstZAw4RFaYMtzBVJ4uop48YZgmu0fPX6g=w680",
"Description":"Temple Run was released on Android in 2011, causing quite a stir with its dynamic and intense gameplay. Currently, the game not only remains relevant, but is gaining more fans among users of mobile devices. The plot is based on a simple story: a certain adventurer was inside the ancient building, where he was not fortunate enough to awaken local monsters. All he can do is to escape them by flight, by all possible means.\n\nGame control is very simple. The character rushes forward, like mad, you also need to rotate it left and right and also to make the main character jump over some obstacles, and slide under the other, respectively, by swipe up and down. There is the accelerometer, so that you are able to change their position on the track.\n\nTemple Run does not spare the player by mistake. Any head-on collision or falling into the abyss will force you to go all over again. It's not so bad, but still fraught, if the character stopped on a branch – monsters get a solid head start to catch up with the hapless adventurer. On these principles and built a crazy gameplay.\n\nThe app is perfectly optimized and flies on a variety of devices. For dispelling boredom, the developers have added the ability to collect coins that must be exchanged for useful bonuses, such as acceleration, invisibility, money magnet. Over a certain amount, you can add a new hero. Temple Run is considered to be the founder of the genre runners for mobile devices, which still not willing to yield the palm to its competitors.",
"M":"Unlimited Coins\nAll Characters Unlocked",
"U":"August 7, 2023",
"V":"1.23.5",
"Link":"https://www.mediafire.com/file/5veg5byqxrrnym3/Temple_Run_1.23.5_Mod_By_Brotherz_Gaming.apk/file",
"Size":"67.73"},

{"Name":"Grow Castle",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEhccU8ehY82ThpfwTBQtWhfZVNnD0QMBAfVeApoGgSRhVqD8e2nJ80DevjZoIxC1zDBU77zljlfrzb1VMSQDH241TT4fuA5Nv94mPVq_2Q0tLJ8GBLBTW1C-MTcC0Q-IkCJ2pAX4gpCXG8r2Wu3h1yiyLR_NCmO_p0WzkuAJJL4icJD-QS4W6L4O84DxA=w680",
"Description":"Strategy is a high level of complexity with elements of Tower Defense, where players need to defend your castle from attacks of various enemies – from common soldiers to mythical monsters. The gameplay is the protection of the castle from attacks of enemies. The player is available several types of soldiers: the brave archers, brave Marines and possessing supernatural powers of sorcerers.\n\nEach class of soldier has their own skills that are useful in certain periods of the fight. There is a leveling of the fortifications of the tower necessary to protect units. All upgrades are manufactured using in-game money which is accumulated during the game. As you progress through the fight will be harder and harder.\n\nThe user is vital to demonstrate tactical competence and strategic foresight to repel attacks. Correct placement of warriors, timely orders and prompt response will help to defeat the opposing enemy forces and defend the castle. With original graphics and music, Grow Castle will attract fans of the genre strategies and Tower Defence, as well as users who love hardcore games.",
"M":"Unlimited Coins\nUnlimited Gems\nUnlimited Skill Points\nFast Level Up",
"U":"August 7, 2023",
"V":"1.37.19",
"Link":"https://www.mediafire.com/file/ncjt6ec757muyhh/Grow_Castle_1.37.19_Mod_By_Brotherz_Gaming.apk/file",
"Size":"64.78"},

{"Name":"Subway Surfers",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEhAC_qL4Z3P8Ft5_jgt4URaKZDl7KYHUAMynA42sWqJvmP5_oH8g_6G5QrcNF9NdsPoCBNhOUjezKVpVjO3BMW2WivLx8zSo3ENVvOPVsf_eXIjv3wtWte-Z5w8alMFTUOCElJuIo12zEg5jdDM7mfcr1OiNjTwVds2bSaTU_TT_JOT82EHOzHCQ7beZQ=w680",
"Description":"The legendary and most popular runner on mobile. The protagonist of the game, Jake, painted graffiti on subway cars with a spray can, but a policeman noticed him, to avoid punishment, your only option is to flee along the railroad, for this use cool skateboards and different amplifiers. Run along trains and dodge them using swipes. Improve your hero's speed and jumps in Subway Surfers mod apk, and customize with new clothes and equipment.",
"M":"Unlimited Coins/Keys (Increase when spent)\nCan Jump Infinite Number Of Times",
"U":"August 7, 2023",
"V":"3.15.0",
"Link":"https://www.mediafire.com/file/hltzysn4x2rxu7d/Subway_Surfers_3.15.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"151.02"},

{"Name":"Zombie Tsunami",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEgB7iuN0PvXqw8SELBf3QP_Jbu3tXOoaawofPFp_T5Jx1CunWmj7V62FymybgmWrLioH359JlVz_DIdcxOHBGVw1gzOR_YhCI_dR5n1a2uLM7uuMtfiB-gSyRzN333cVPo88QahwTkwh92DxvItlieIhdhkHRAYNKDlWsVhL5uhD5a_lZL8_FUNLqDbLQ=w680",
"Description":"Dizzy game in which you are waiting for many adventures. You have to play a green little man who wants to infect and turn everyone into the same being as he is. You will rush forward destroying everything in its path, and biting people. They will run behind you and help collect coins and bonuses. Also in Zombie Tsunami mod apk you can buy improvements for the money you have purchased, they will increase your income or help to collect it. You are waiting for the simplest management and colorful graphics.",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"4.5.128",
"Link":"https://www.mediafire.com/file/xhjbig695l6v2wj/Zombie_Tsunami_4.5.128_Mod_By_Brotherz_Gaming.apk/file",
"Size":"69.47"},

{"Name":"Vector",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiuK6LQQXoinMYyOg2RbXB9rZT6IkMksoQemyknxdb7cPooZqwMrzIFVohKhMX5-H6rrz7Uv3qyVqA_bpcbQ_8ZfKmsm8WAYZqMPQh9fzepx44b9kt6rp1mKOEwaUiXi0r7id-lgA1k0iO9L_sAVuwZ_g2DPYcxCSIVNNmAZP30q1VCyDK_kpsbOI1XfwAQ/w680/unnamed.webp",
"Description":"A runner arcade game for Android, dedicated to parkour, which will take you to the bustling concrete jungle where you have to use the roof and walls of skyscrapers as well as all available means for rapid movement.\n\nIn the story, you broke free from the shackles of some totalitarian organization, and now Lili. Constant spirit of persecution makes the gameplay exciting and dynamic, and pleasant surroundings of the big city creates a unique atmosphere cool blockbuster directly on the screen of your phone. Difficult tricks in the style of a Pro parkour on different tracks look really impressive. To all the tricks looked the most realistic, character movement was withdrawn by the developers with real stunt, with the help of special equipment. Because the hero looks like a living.\n\nVector very simple to learn. If the tricks themselves are very complex technically, it is possible to perform them on the screen of your device will not be difficult. Enough to have the reaction time to perform the necessary actions. Sea drive and adrenaline flow from a continuous chase is guaranteed.",
"M":"Unlimited Coins",
"U":"August 7, 2023",
"V":"2.0.3",
"Link":"https://www.mediafire.com/file/f34e16129tatcik/Vector_2.0.3_Mod_By_Brotherz_Gaming.apk/file",
"Size":"151.91"},

{"Name":"Jetpack Joyride",
"Category":"Arcade",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEhv8pvUTt7gpFIbnIBUFGDvTQKMJQK_39CwGk1SR8B--muP_GQS4NW6CJontoL2EiwuAz5Ebe365vfJoK5uypmygyeWFBT7mo0-aY5U007K4nIsneZgPKt8BFzp2qp1qC1YfxXHahXIi5jqAXLfE_wj1QNmXvOhZjX3ixxD2g_yS7IkOq-GHIUQQY2iDA=w680",
"Description":"This game will allow you to feel like a real hero, because as developers tell us at the beginning of the game, our main character was very frustrated with their situation and works on paper. And so dawned on you, you have seen how scientists have invented a backpack. Since then the game Jetpack Joyride mod apk begins. You have to use not only pack to fight with opponents, but also a mechanical robot costumes. During the game you will also collect coins for which you can buy improvements. Be a hero, help scientists to make their invention even better.",
"M":"Unlimited Coins",
"U":"August 7, 2023",
"V":"1.79.1",
"Link":"https://www.mediafire.com/file/1n9q89g7dbpn328/Jetpack_Joyride_1.79.1_Mod_By_Brotherz_Gaming.apk/file",
"Size":"157.76",
"Note":"Play Only Without Internet Connection."},

{"Name":"Good Pizza, Great Pizza",
"Category":"Casual",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh45VbgRHuMQELj5gyAySnP9MJP0G_CqOuBWNFm4n5Ptkgqr8d-VpHj7v0AyBnkhZYSfroSViJExOBJ9YyOi73nOpIthMKvtiCWa7BdqCNm0BQogz6Raa1esnAVcn1B8KrLA0aVkMm2VpsifHVMoAEaDf88-w5EayBT_WpLcQi8i_kvkCqn4FjTMaOV4A/w680/1561575294_1.webp",
"Description":"A casual arcade manager, which the user will manage their pizzeria. Here, the player will prepare a fragrant pizza in his own restaurant. To ensure that visitors regularly come to the school, it is necessary to satisfy their wishes concerning preparing this dish. You also need to fulfill orders as quickly as possible, In turn, satisfied customers will bring profit that can be spent on the purchase of new kitchen equipment and business development.",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"4.26.8.1",
"Link":"https://www.mediafire.com/file/5t29xs0mqa26cqm/Good_Pizza_Great_Pizza_4.26.8.1_Mod_By_Brotherz_Gaming.apk/file",
"Size":"146.99"},

{"Name":"SpongeBob : Krusty Cook-Off",
"Category":"Casual",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEghHgr-AE1m21V7f73PEO7PqZAXRce3gHiUem8Y1XHAhn5C2qU4Ahi3oeLYzXjjOoWv5R-F1Vphd0PPalQ5jSKwjOL7erWZK4K6rt6gpcJqrl47hHTChs0wQSoYLwEEJwD8lMwFz5a7VTVlkRqC7SHtZdwxS3bDCtu3LEshu1Qsev5ufPbnnyLhubL2Lg=w680",
"Description":"A casual arcade on culinary themes whose creators decided to take as a basis the popular animated series SpongeBob SquarePants. According to the authors' idea, Mr. Krabs decided to open a network of fast food restaurants and, of course, invited all his friends to help. In general, the game mechanics are made in the usual style for the genre, prepare food, serve visitors, develop a network of eateries, complete tasks and communicate with the characters, while the creators managed to maintain the original atmosphere and graphic, which will undoubtedly delight fans of the series.",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"5.4.3",
"Link":"https://www.mediafire.com/file/h14nz1b8ft7kclf/Spongebob_Crusty_CookOff_5.4.3_Mod_By_Brotherz_Gaming.com.apk/file",
"Size":"157.83"},

{"Name":"Idle Arks : Build At Sea",
"Category":"Casual",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEhmXP__5-agG06wtjCSwFPqOlTC2-SuZD2AChvDyrLCXpjZnYgJzBAMJUamkaw5eS0cDM3xUe8097puHdKTsFLOQSjPOc9-obm5mYk5UoRFHWUmaQTywIvkPnAeat2WXcFEBHxlrOwrZMolzBk4D9tsRFe3Duo7LqqcJOBUCIUEMeiQsNOPBAv92KgJDg=w680",
"Description":"There was a huge flood, all cities and countries were flooded and you'll have to save the whole world! A cube-style survival simulator in which you will sail a wooden ship in search of resources for survival. Firewood, plastic bottles and chests will pass by and collect them so you can expand your ship to the size of an entire island. Idle Arks has a change of day and night as well as weather, snow and thunder.",
"M":"Unlimited Money(Increase When Spent)\nUnlimited Resources(Increase When Spent)",
"U":"August 7, 2023",
"V":"2.4.1",
"Link":"https://www.mediafire.com/file/j9egj1y63mvi40x/Idle_Arks_2.4.1_Mod_By_Brotherz_Gaming.apk/file",
"Size":"105.61"},

{"Name":"Farm Ville 2 : Country Escape",
"Category":"Casual",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgAOfYGLq8zmEeWshVweo2-yW95pGmCSdE-hiRd0j0AwN8OzaEMfv6HfOjt3cU39D_VnJXKfu3z8_dFSjthCa1P7mY2_1kxeYUFymG-rjCfLm5GJJj0UvLPx3NU17qGDinvKuUAgXHiiQG84AYh7qDh9cfnd1UqWnEHugIZIP7MCj0_8FEDTRqJYXxhrA/w680/unnamed.webp",
"Description":"The game allows owners of mobile devices to create their own farmer's Paradise. Improving the site, you can open access to new types of fruits and vegetables. In addition to crop production, the players available for breeding domestic animals and fishing. You can make a farm of their own accord, due to the presence in the directories of the games many collectibles.\n\nWith their help, to give the house on the site unique design will not be difficult. In order to enjoy games you do not have to have a permanent connection to the Internet. Even in offline mode users can search for rare items and the creation of a book of new recipes. The higher the level of development of your farm, the more different techniques you can purchase.\n\nEvery day, the user is prompted to perform the new tasks. FarmVille 2 Country Escape the possibility of sale of finished products to other players. If you wish, you can create a farmer's Alliance and trade with your friends.",
"M":"Free Shopping",
"U":"August 7, 2023",
"V":"22.9.9404",
"Link":"https://www.mediafire.com/file/jpodk74a6uaw6d5/Farmville_2_Country_Escape_22.9.9404_Mod_By_Brotherz_Gaming.apk/file",
"Size":"153.67"},

{"Name":"Dancing Road : Colour Ball Run!",
"Category":"Music",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEgRGbtj-ZXGGlUYavf1tYBy8uqxazE0MGCvdFXVs9y5I7jC5VD0aTxldwcOJQHJda6FWfZ5paTQp8pKehmtfhm6MbKAG7MgzERIrTZjvFYfsQpmKyjz58E2YFwaSTqJ6th7e7TQdw51lCBiNonTNPIPEW7IFDNqmRfwfsMvNGUhVf2iQwr7kyXHmwAc9Q=w680",
"Description":"Arcade musical rhythm whose creators decided to look at the popular direction from a slightly different side. And so, as in most such games, your task is to combine sounds to create combinations of sounds that will add up to the composition, but the mechanics themselves are somewhat different from the classical representatives of the genre. You have to control a moving ball which, as it moves, will change color and constantly accelerate, while you need to move the ball to push it with objects of the same color. A wide selection of compositions, dynamic gameplay and colorful neon-style graphics will undoubtedly please all fans of the genre.",
"M":"Unlimited Lives",
"U":"August 7, 2023",
"V":"2.3.1",
"Link":"https://www.mediafire.com/file/y4b77b9xyiwtcc3/Dancing_Road_Color_Ball_Run_2.3.1_Mod_By_Brotherz_Gaming.apk/file",
"Size":"121.38"},

{"Name":"Magic Tiles 3",
"Category":"Music",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEifFwdQ-Wp0Sv1_fFNNQkOOAGjJxshS9ZVLC3J92gsKpFC246XEH78xLPaMz8vakYctImA0Fre26QywBgEhYM_T2me0RQB_OlWtLam2sh8OLOvVY-6GHtkPet38PHslgiCz_dZXvCazAQg90HuvLFT-is6KQ9Mk6SZiQUhx5K7JMwg32EkxePEQAlRwTA=w680",
"Description":"Magic Tiles 3 is a classic musical arcade game in which you have to take on the role of a guitarist, a pianist, or a drummer. In earlier versions of the game you could choose only one musical instrument, but in the third part, which is now discussed, you can try your hand at any instrument. Game mechanics is very simple, your task in time to tap on the running tiles of different sizes, thereby creating a small musical masterpiece. Magic Tiles 3 has excellent graphics, dynamic and rhythmic gameplay, the opportunity to prove yourself as a composer. Complementing the picture is a variety of game features, which will give variety.",
"M":"Unlimited Money\nVip Unlocked",
"U":"August 7, 2023",
"V":"10.072.102",
"Link":"https://www.mediafire.com/file/qvj5787phbtzu4s/Magic_Tiles_3_10.072.102_Mod_By_Brotherz_Gaming.apk/file",
"Size":"151.33"},

{"Name":"Tiles Hop : EDM Rush!",
"Category":"Music",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEiZUBRGXWvmx56VKYCiRWbmtWtD6arpWWffllij8zWrz1hdy-qZz9R83POSM0GLABvdBO_RnkhJ_-cMAQdSWfHLWk60yeNAdxlyrAsUlIPnF3otGVvvF_FkM3O78JH_EjXD3FZgbUU22LgSlXOC5kdCzN8PUSsdO56iXWfPNmiDhJ4uOi38CWqLBvHqDg=w680",
"Description":"Musical rhythm arcade game in which you have to perform endless marathons for selected melodies and compositions, while your task is to control the ball and try to jump over moving cells as precisely as possible. In this case, the rhythm, duration, dynamics of the game will directly depend on the selected composition. Visually, the Tiles Hop is executed in the best traditions of the genre and will undoubtedly please all fans of this direction. Separately, it is worth noting that you can pick up the music yourself.",
"M":"Unlimited Money\nVIP Unlocked",
"U":"August 7, 2023",
"V":"5.6.2",
"Link":"https://www.mediafire.com/file/9ipjm3k2hd5ye58/Tiles_Hop_EDM_Rush_5.6.2_Mod_By_Brotherz_Gaming.apk/file",
"Size":"143.43"},

{"Name":"Beat Fire - EDM Music Gun Game",
"Category":"Music",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEicTUDs2KFW3VdHOUuL7twTbozpOO-NsKiwO-95TXELWYMH_DabD07Ro-QIxR4HGSsif4q70ke-XAGyrqWDNVrcqRXIbr7lSmKrfqn4H_2vYdhmN7aTWO45KhHCaENKVws3Aj69_5iixRSLZwE5wRaOgx-28J_jfuASkCyRpZDRZ7HibG6aoK88Wgs9gQ=w680",
"Description":"A musical arcade game with a familiar gameplay in the latest version. The user will be able to enjoy the gameplay, at the same time listening to various songs of different genres. A distinctive feature of the game is that interaction with objects falling down here is done using shots from a firearm. Each completed level will earn a certain amount of points and awards. Success will provide access to faster-firing and powerful guns, which will make the game even more fun.",
"M":"Unlimited Money\nVIP Unlocked",
"U":"August 7, 2023",
"V":"1.3.05",
"Link":"https://www.mediafire.com/file/lshoowxugik24jg/Beat_Fire_1.3.05_Mod_By_Brotherz_Gaming.apk/file",
"Size":"47.66"},

{"Name":"Homescapes",
"Category":"Puzzle",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiw3LYye4lO-7yvQEl7t6OdN3A-qEXRf4qzHo9kEILW3-xLdsTeohkJVBdcJZMR0dcVDFVfer2mCMb50kvaoYssMeeSaBAJYn58zxmikDwFJuf_-o-QpnfXk6NFEfNRbCAJuqBYngdV-EWSqcRKdJgDKen4cxVEwws3gIg7tW48hdampK0FbUeTFNNnoQ/w680/unnamed%20(3).webp",
"Description":"The classic puzzle 'three in a row' for Android devices. The protagonist of the game, the butler Austin, needs help in restoring the old mansion. In the process of passing the levels, the player will get acquainted with each room and room of the house, as well as its inhabitants, while trying to make chains of identical objects. With the successful drawing up of rows, the user will have access to furniture to improve the interior. To fully restore the mansion, you will need to quickly go through each stage and use a variety of bonuses and improvements.",
"M":"Unlimited Stars",
"U":"August 7, 2023",
"V":"6.3.2",
"Link":"https://www.mediafire.com/file/vqgq4l2ld6k7i36/Homescapes_6.3.2_Mod_By_Brotherz_Gaming.apk/file",
"Size":"174.03"},

{"Name":"Farmscapes",
"Category":"Puzzle",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiykAnTCBEu7SL9IdwPp6JNBOJNQSoxv7ioSO5a3lVgt3opNpci82cA70MsGBvEjJCK_a15RLgffS0mtm55TVutPIJ9DhEPij-32ZxoBrwGGcGOuabBuzriy-AGDp0Sr_P75tvWFZcz06ssLC-tDeTdJyDjQnfR-2hUgK-3JgqIRl86NYJEJhfcqDjZ9g/w680/unnamed%20(2).webp",
"Description":"A classic puzzle game in '3 in a row' with elements of building simulation. Users expect familiarity with a pretty girl, Mary, decided to leave the metropolis and move to the country on a big farm. After arriving on the scene she was horrified to discover that the farm is in a deplorable state. Now she will have to do repairs at home with the transformation of the territory. To do so it will be in the campaign, the handyman, Philip and Edward happy cat that will help to quickly deal with the accumulated problems.",
"M":"Unlimited Horseshoes",
"U":"January 12, 2023",
"V":"2.5.10",
"Link":"https://www.mediafire.com/file/1pokwqnbai689rr/FarmScapes_2.5.1.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"280.65"},

{"Name":"Lost Island : Blast Adventure",
"Category":"Puzzle",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEhRZD55IkscFsHCX0E9v2ZI2gdHUa2Y6_KYjVjZmiXlyf_8PA3S3wLLJThDeCJOw5y04hTPUJBHE69BjEiENaeFTwOUsTJ6nrwuoGDFpbT2mTD0Ya3zJR7nq6npwKcshjqLh0bwYeXLxc8q9H7ajxCjAfKuBOE3wHEPPBypfyR5wj_KjSMLmsEwjAph7A=w680",
"Description":"Arcade puzzle from the series three in a row whose creators have added to the popular gameplay adventure storyline and elements of a farm and a city-planning simulator. And so, according to the storyline, you have to go to a mysterious island and try to build your dream house on its shores, but it is worth remembering that according to rumors, some mystical creatures and even spirits inhabit the island. Colorful graphics and a huge number of levels passing that you will solve intricate puzzles to attract both lovers of puzzle and adventure fans.",
"M":"Unlimited Lives",
"Note":"Lives Increase When Spent",
"U":"January 12, 2023",
"V":"1.1.1011",
"Link":"https://www.mediafire.com/file/2m5n0gt7lhj8cl3/Lost_Island_1.1.1011_Mod_By_Brotherz_Gaming.apk/file",
"Size":"162.69"},

{"Name":"Merge Dragons!",
"Category":"Puzzle",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEiF-U0I6f17uBXXE_RxrKgy9kJHWasrQ4e-U6ylh0zmEqShaCr8ECqzD6CKddxIz46eIqhHjPj0zWwCdN4DlaP2KWI_0wNtagD3t4DPzy8biFmbHc9QdD5JjqEj0d6IAorEPUoYZz_6OxpMSlbC2HbSmMgNHZpFErwlvnaQtRHEOfB_e0c2T_m3x9NMmQ=w680",
"Description":"A puzzle game in which the user will stand on the protection of the country of Draconia, which is under attack by dark forces. Here it is necessary to make chains of three or more identical objects to get new objects. Using the magical abilities and logic, the player will receive many items of the highest level. Gamers will find seventeen types of dragons, one hundred and fifty exciting levels and about five hundred items. The game has good graphics, a lot of gaming locations and will appeal to fans of such projects.",
"M":"Free Shopping",
"Note":"Buy Everything For Coins And Gems Even When Not Enough Quantity",
"U":"August 7, 2023",
"V":"10.7.0",
"Link":"https://www.mediafire.com/file/gkujwd53x0qdo85/Merge_Dragons_10.7.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"152.42"},

{"Name":"Sand Balls",
"Category":"Puzzle",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEiXkIFNOOO4Diupzt2zt-952zFEZ5-P6dIKEILS2YZrBzDTSkm32KFG0KFrzCOScB11Zy7PZ4gOEiDWdsT091LtGYsw6EV4tsBV0WwcXSYmqGQK-1s10L9-mvy9L4RNAW_6cyOzRh0vRyeq_nb_aLFJeoi40ZUGO60j4_00KsvlDjPeiyPW74DQtTp2GA=w680",
"Description":"Physical puzzle with interesting gameplay, where the player needs to steer the flow of colored balls. To deliver balls to the target, the user must clear the way from the sand and to pass obstacles. At each level there are holes, hills, and other objects that can help move the balls and to prevent. In case of successful passage through the obstacles and traps the balls fall into the back of the machine, and the user will go to the next stage where they will expect a more difficult test.",
"M":"Unlimited Coins\nUnlimited Gems\nVip Unlocked",
"U":"August 7, 2023",
"V":"2.3.29",
"Link":"https://www.mediafire.com/file/9cy6usqph6vx8i5/Sand_Balls_2.3.29_Mod_By_Brotherz_Gaming.apk/file",
"Size":"211.35"},

{"Name":"Hill Climb Racing",
"Category":"Racing",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi4hjGa1Lu_Xa0nh--p9Kq7FtvAFycEwBjcUx0XNp8mgDGvEepp6jzz__HW6uLx5R9I50AJF5NkBHnl-Kpb6LeTiihlg_vWR5PQe3qIyLcXfX5PFbCa9UIwTbbV1vo1vun1cRa15y5-SWM_PjhoFVsSd3E9CYchsjE7W8np-xdeH0vxn0YDDRD9VM-CSQ/w680/1562079106_1.webp",
"Description":"An exciting race for android that can surprise you with a developed physical model and addictive gameplay. The main character is the ambitious Newton Bill, ready to conquer the highest peaks. In the process of gameplay, we have to improve our abilities and improve the car.The game has bright and attractive graphics, good balance and an abundance of different levels.\n\nManagement tied to the use of the gas keys and brakes. Since our car is rear wheel drive, with a sharp start it rises a little forward, and when braking, on the contrary, it goes down. To successfully complete the levels you need to learn to feel a similar balance.\n\nAny level contains a small distance that must be passed without crashing. In the case of a coup machine, the level will have to be rebuilt, but, fortunately, the money earned will be saved. After the check-in comes the calculation of earned money, which is spent on various improvements.\n\nHill Climb Racing contains many worlds opening for play money. All levels have their own coverage and physics. The last few locations are located in space, where local gravity makes significant adjustments to the gameplay. To get more money and points, we need to succeed in various tricks, which is extremely difficult to bring to life.",
"M":"Unlimited Coins\nUnlimited Gems\nUnlimited Fuel",
"Note":"Before Playing The Game For The First Time, Go To The Shop And Purchase One Container With Gems",
"U":"August 7, 2023",
"V":"1.59.0",
"Link":"https://www.mediafire.com/file/qnys8sxtrh1r3mq/Hill_Climb_Racing_1.59.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"83.73"},

{"Name":"Derby Demolition 3",
"Category":"Racing",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEju9CcS1XBoAzBZxkIUkqQD6krDOzwni0Rx0zgzspTdRpdz2XResDQChk-zKrNaqCT0SNm0q0mlLDSt_P1-mEZbYa6jd4t8IgBxKHsGUz2p27BCIHH2OYMZf5LSvoN2eLOAXYvW94VpT-BqRBRYEdjFQLwmJCKWSG7C0G64FuloFKByHtAErcgn2JDLNg/w680/1562051123_1.webp",
"Description":"A continuation of the steep race to the bottom, where the goal is not to reach the finish line first, and to destroy all the cars opponents. Compared to previous parts in the game, a host of new cars, discover fully possible only in case of a successful game. There is also a multiplayer mode where you can race against real opponents. In the process of confrontation players will be able to enjoy excellent physics, destructible and high-quality graphic component.",
"M":"Unlimited Coins",
"U":"August 7, 2023",
"V":"1.1.105",
"Link":"https://www.mediafire.com/file/nhr1rqmr7s5tlky/Demolition_Derby_3_1.1.105_Mod_By_Brotherz_Gaming.apk/file",
"Size":"160.12"},

{"Name":"Derby Demolition 2",
"Category":"Racing",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhUNFnG0t1mIFL0GroEulHO7gzYvuNZ4HgpVmu0m16WwLMrgRrebaEU2orR4VbNEba1t6pu0HD3eTIt0dYXu2ogl1yjiagcsVtUu5x7A2Ol-PnKChi7gih5YOFh6T36bwGIybUtokD6EpADEWZV1CgZFWfsaIhldFrF7YaHoIH9917lyAEgZxHDCXLy9Q/w680/1565787001_1.webp",
"Description":"A tight racing derby in which the driver must not only reach the finish line, but also to eliminate as many competitors in its path. For this you need to skillfully manage one of a dozen of the cars to go around regular cars and not give a chance to the opponents. In this game the user will be able to try a few tracks as well as on several arenas where the battle for survival. All the machines for greater efficiency, you can upgrade and repaint to your taste.",
"M":"Unlimited Coins",
"U":"August 7, 2023",
"V":"1.7.06",
"Link":"https://www.mediafire.com/file/j4opvoptbld7xvm/Demolition_Derby_2_1.7.06_Mod_By_Brotherz_Gaming.apk/file",
"Size":"114.19"},

{"Name":"Crash Of Cars",
"Category":"Racing",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEii_0uyLWruoTOiZ4VLTyX5pduOitW6ZPQp6YMtGbsjRwOjQ32TkCL_jFLSGrhfllGRXAz6tQpRwMdCVhTpTBnfcawLmPnnch7bgYa6X5rka_L1fHeQ-_IjSQdqBO1xakbO-EO42VkfuhTec4hbu3HO3pZvkujngvCw9NMSo0fOx23yC7WNBi0gKyqlFw/w680/unnamed%20(6).webp",
"Description":"Arcade racing with the top view, in which you need as long as possible to stay on the move, playing at a variety of locations. Gameplay is simple and consists of collecting as many crowns scattered throughout the map. Car player is thrown out on the playing field, where there are cars and opponents, trying not only to prevent but also making every attempt to bring a user down.\n\nTo confront them will help located here and there are improvements in the form of firearms and bladed weapons, and explosives. Sooner or later, the margin of safety the machine is running out and the user is sent to the main menu, where the raised crowns turn into play money, which can expand the assortment of fleet of school bus, heavy truck or racing car. In total there are about 30 vehicles for every taste.\n\nGraphics pleasing to the 3D animation of cars and tracks, delivering an engaging gameplay. Control is done by pressing the right and left sides of the screen. The vehicle accelerated independently and has no brake pedal so you only need to guide him. Crash of Cars – great arcade racing, which is a great time-killer. They will appeal to all fans of the genre.",
"M":"Unlimited Coins\nUnlimited Gems",
"U":"August 7, 2023",
"V":"1.7.08",
"Link":"https://www.mediafire.com/file/bc6hqgz6enyqqdg/Crash_Of_Cars_1.7.08_Mod_By_Brotherz_Gaming.apk/file",
"Size":"153.35"},

{"Name":"Traffic Rider",
"Category":"Racing",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEhWHVaOWqcm1EjLukk_0UVlepq2drkXPVKYig5p6IL4i6pcyBpP9EVA07tvJ8Dj_cdUQ5TObeb9IFOPGJSTuoWzzu3fK3mIWay2cgAgL24zqmfY5V2CniNFAEd45QtALF5Z5LicEdLnZoXS6hLfLJ7ijoXpFlm-uKSc02rrF9f_LQVfLIcde4dHcok9uw=w680",
"Description":"Racing game for Android from the company Sky Games, you regain the ability to race at breakneck speeds on motorways and urban roads. Now, however, offers a completely different means of transport – you can ride a scooter, or to feel as a dashing biker. This opens new prospects for the gameplay, for example on the motorcycle conveniently to maneuver between the traffic flow, which significantly adds drive.\n\nYou have to create your own racing career, having initially only a simple scooter, with a scratch produces up to 100 kilometers per hour, but in the future you will be able to purchase really powerful 'iron' horses. The game sets itself apart from competitors (a list of which can be compared with the volume of the Great Soviet encyclopedia) interesting modes and submodes, in accordance with the racing style, kind of job, level of difficulty and scale of awards.\n\nAnother undoubted advantage is the variety of memorable locations, which, moreover, they live their lives: change time of day, the weather changes. One of the most interesting modes is called 'Route': you need to overcome part of the route for some time. In addition, there is the survival mode (as long as the driver gets into an accident), at the time, and free mode, which is focused not on earning in-game currency, but on the free races on the roads of the virtual.\n\nYou need to thoroughly succeed, earning money to purchase new motorcycles and scooters, as well as to update the old. Otherwise it is extremely difficult (or even impossible) to reach the finish line. Traffic Rider features different types of controls, among which you will not be difficult to choose the most convenient. Overall, this is a great racing simulator that is worthy of continuing the undertakings of his fellow - Traffic Racer.",
"M":"Unlimited Money",
"U":"January 13, 2023",
"V":"1.95",
"Link":"https://www.mediafire.com/file/70770r4ql45l8e4/Traffic_Rider_1.95_Mod_By_Brotherz_Gaming.apk/file",
"Size":"141.25"},

{"Name":"Tap Titans 2",
"Category":"Role Playing",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhgg5HnQ2eUnfyxX85f-198hTIgcAfxBbLyqsO5-JWEnD4iDXtDy3cSZijrdfjzV1uLVrArxwdSYWV4VaFh60e0U2WGP6YUBnMrec3DBRLwsUTL8p6IlM51gUtkGOr1g45hSQqttI1xs_D8lry57Qk-QQAMIdkdZjybb_zeqb5wv5kcHsvqJZ0fxoLy5w/w680/unnamed.webp",
"Description":"Crush the arcade, giving you the opportunity to come together in a battle against the greatest monsters. Gameplay is a battle with various enemies. It is only necessary to press the screen in order to brave the main character was hitting villains. Happen faster than pressing, the faster the character slashes a sword and kills demons. Killing one monster it takes place instantly following. As you progress to fight side by side with the hero will become helpers, which will inflict some damage.\n\nFor the massacre of every monster is given in game currency that immediately need to spend on improving combat performance and health of the main character and his assistants, because the enemies with each new level becoming stronger. Also in battle you can use superpowers that spend mana. Over time it is restored.\n\nGraphics pleasing to the eye. A huge variety of monsters and the periodic change of locations are not bored from the monotonous gameplay. The soundtrack and sound effects beats perfectly complement the atmosphere of the game. Tap Titans 2 is one of the best representatives of their genre and are able to captivate for a long time.",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"6.0.1",
"Link":"https://www.mediafire.com/file/d6orprzmqum9rj5/Tap_Titans_2_6.0.1_Mod_By_Brotherz_Gaming.apk/file",
"Size":"160.56"},

{"Name":"Tap Titans",
"Category":"Role Playing",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiBut1moix15wgBokFUkVEcw_Fx6XLMchxICZ1kK55f7XQLpO5l8U20PMK8D0DCKoXzqHlG7uiyeGOmi_Aw5wfQ_AHSc4_KaZaFhzLaNQNyW7oy_kPb5dJedyOQ3MrcPOiot8doyah1tccbovM9WY5DXS_B7VekaoW6x4efbAiWSLQQpw9GP0NBJylQOQ/w680/unnamed%20(1).webp",
"Description":"A classic game on Android. In the story of the mighty titans have invaded the Kingdom, and the protagonist must defeat them to this fantasy world has returned to goodness and justice. During the passage of the protagonist have to battle with more than 60 monsters. To defeat them, the user needs as quickly as possible to click on the screen to conduct offensive attacks and defensive maneuvers. Also the player will have a number of meetings with various characters who can help in battles. Do not forget about collecting powerful weapons and magical artifacts that can become the decisive argument in the battle.",
"M":"Unlimited Money",
"U":"January 15, 2023",
"V":"4.1.6",
"Link":"https://www.mediafire.com/file/ht3fn9dcrre5q81/Tap_Titans_4.1.6_Mod_By_Brotherz_Gaming.apk/file",
"Size":"75.7"},

{"Name":"Ninja Turtles : Legends",
"Category":"Role Playing",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEhfrENeNoJuELIJtdALJk0-ecu_T1jr3V9KKgmXFrjU87BWg-lUWZAtIs9lUk_ZLW3_fEq_Dyn1yniQdASEl5XgkFX4lbIc_lPwdsKkcYiOhWSxnyQLHgPmHC5p-hWQMXqVbEGLiYpjyPf5iKFgs9XMA4nSmjR-hg5ln9An-ToN_j7PGJjqo0mA5wTzJA=w680",
"Description":"The game is in the genre of TBS with your favorite superheroes of childhood. In the story the team the turtles need to fight the villain Krang, who is hatching a plan to destroy the world. But on the way to it will have to fight with a huge army of his minions. Before sending in fight the player is asked to undergo a brief but informative training.\n\nThe gameplay is a turn-based battles, in which alternately to attack and to defend against attacks. The battles are dynamic and interesting, so bored on the way to the final boss will come. In battle, you must choose targets and carry out attacks using spetsumeniya turtles. After each battle should go to the main menu where to earn money to buy cards that the skills of the heroes.\n\nGraphically, the game is designed in a classical style projects about teenage mutant Ninja Turtles. There are bright juicy colors and effects, nice animation of characters. Complement all of the above fun sound effects and catchy soundtrack. Ninja Turtles : Legends is good step by step strategy that will appeal to both nostalgic adults and children.",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"1.23.3",
"Link":"https://www.mediafire.com/file/kwfs6gfcft7jij4/Ninja_Turtles_Legends_1.23.3_Mod_By_Brotherz_Gaming.apk/file",
"Size":"105.21"},

{"Name":"Eternium",
"Category":"Role Playing",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgou_YkplKGZVuG2HchTQq0J5fWvQxlVtRnr_7kQRIqPd8ZUH5xUSekpYPUH5hnYj2jCVWhwtL6Zwsj543QTjeJUOVxy1l1Hk6PTW4rt0DiMjUG-CfNee0-NoFDKXsOrMYL9pz2HTQaAqgzqXimUxMEipblPuqMXqBMXSIfVgUzLzA_XdtGADVrANnFNQ/w680/unnamed.webp",
"Description":"An excellent RPG with beautiful graphics. Take on the role of a Mage, Warrior or Hunter and explore all the forests and dungeons, looking for precious things and pump your character to the limit. You will be able to create different amulets and rings, which will give you additional abilities. Take part in duels against demons, zombies and even robots, the game has the ability to infinitely generate new levels. Beautiful special effects and dynamic battles will appeal to all fans of Action RPG.",
"M":"Unlimited Gems",
"U":"August 7, 2023",
"V":"1.7.9",
"Link":"https://www.mediafire.com/file/nafjettezqlk8cu/Eternium_1.7.9_Mod_By_Brotherz_Gaming.apk/file",
"Size":"136.16"},

{"Name":"Turboprop Flight Simulator 3D",
"Category":"Simulation",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh44TPLE9slYjyBK56ODEx_fL6u0qgvAiu2JkyZQj58sKn5fbPUgqBPlYfsKPo83rMOF4jvSgT1fARuAhdHdrYW-ybv9VYuHYQUGHUUUj3_6gK46G-Xhzs9AbTaOaeB0sjvEMyoSBQoiri9YV3rLUX7p4uHNo2cgUiq43PaYIHz_ZrnV2mFfBspivboqQ/w680/unnamed%20(1).webp",
"Description":"A simulator of flights by military transport aircraft. In the game the user will take over the helm of military aircraft will perform various missions. Initially, the pilot will need to perform several learning tasks that will help you to understand all the nuances of controlling a multi-ton winged machine. After that, he will deliver an important cargo to different airfields. Also, apart from jobs there is the opportunity to freely fly and enjoy the beauty of the game world.",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"1.30.1",
"Link":"https://www.mediafire.com/file/cnulhn9otfhaigh/Turboprop_Flight_Simulator_1.30.1_Mod_By_Brotherz_Gaming.apk/file",
"Size":"67.94"},

{"Name":"Rebel Inc.",
"Category":"Simulation",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjQScdT6nLCHDsDzlnCdhwEHvOoU_z4m_WTVN3q9HXVfytg2pk8NQRtaMqt0vUHu1MnI-1HOjjxt3xm8rH_f6b5gfebkAgfrp6L1GKwAkYI3amMaJrTJlRriRZEPKKYq1kpQFTkiUMnSvNwKNZvha8QF2w8srJ11DiDHsC5NCtNGOIeZgiETryDxFUdZQ/w680/unnamed.webp",
"Description":"A realistic simulator whose events are developing in a certain world in which the hostilities just recently ended and although the troops have already withdrawn the order in the region have not yet succeeded and it is you who will have to deal with the situation. It should be noted that the developers have paid a lot of attention to the realistic model of everything that happens. Unpredictable events, unexpected turns and various force majeure will require from you a clear analysis of the situation and timely decision-making, the execution of which may require the development of sophisticated algorithms.",
"M":"Region Tour Unlocked\nCommand Pack Unlocked\nAll Advisors Pack Unlocked\nScenario Pack Unlocked\nDark Tunnels Pack Unlocked",
"U":"August 7, 2023",
"V":"1.14.2",
"Link":"https://www.mediafire.com/file/54g6a9g505lxcmq/Rebel_Inc_1.14.2_Mod_By_Brotherz_Gaming.apk/file",
"Size":"76.24"},

{"Name":"Make More!",
"Category":"Simulation",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg14YEBMfWejXjMEYxsugXrus3ja7NX3frVq6BbCVTNwuXYSpY7-zMWBC3Bb56uCzG2IxxLRyDDCu86ijQw5qDEiI8zgSWNL2NpiirfZpCf1VZUwM7TvrGBBChw0bn8_8UyJCIiRXstRfWt6MHBmoTYzrG5c4cs9pRjBFNMTA6smSnf4M9IbFc2Lx7hSQ/w680/unnamed%20(1).webp",
"Description":"An unusual game in which the player becomes the owner of a factory that produces various goods. Initially the user will only be one worker who will work hard. Hard pressing the screen, the gamer will receive in the treasury cash, which will go to expanding business empire. You can further expand production, opening up new products, acquiring factories and hiring new workforce. The game has simple controls, funny characters and nice graphics.",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"3.5.17",
"Link":"https://www.mediafire.com/file/cz7fp20lf3ars4z/Make_More_3.5.17_Mod_By_Brotherz_Gaming.apk/file",
"Size":"39.09"},

{"Name":"PC Creator : Building Simulator",
"Category":"Simulation",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEitSMPdqt0EYcFdqykoE-B-KRmMXtYq5IvB3GoNnvzEsPhdcVRmmD_IuC6WHp6mPwtYsP7NDHOFBkbgJEmPlvNY66eQhF9VlbDjshfF4p8YX4QlT022CF8tbZ-OzwC3X3bZLb_fPkZ63WSVUDaO-i0M9Cla31uKsor--G0l8cHjSbvxDS_JXhAbxwbX1A/w680/1600325458_1.webp",
"Description":"A fun simulation game in which the player will be able to learn about all the intricacies of assembly of personal computers. The user will need to collect your PC from various components such as the CPU, sound and graphics card, memory modules, power supply etc. Also he will have to work with the software part, installing operating systems, drivers and various applications. Assembled PC fashionable will be profitable to sell to customers, thereby earning money.",
"M":"Free Shopping",
"U":"August 7, 2023",
"V":"6.5.0",
"Note":"You need to have an internet connection to purchase diamonds from the shop, the game will show purchase failed but the amount will be added to your account.",
"Link":"https://www.mediafire.com/file/e6o6h6ma1cdochz/Pc_Creator_6.5.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"150.72"},

{"Name":"Plague Inc.",
"Category":"Simulation",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhptm5YRruEuQv6q7vN7UZif0tNCFth5obCMh0uX9VINYqslIVJqZx8IFNY19tXnBDUIRLGxWAGLVHvBeFcw-1pFjfaE48aVqgCOK1x4E5H19yEfDmZjkYl7Fk7Wt808aglCPR2_ctzb4HKRictI1g-xFY_-9e9jWaTJ1nMXuU0cJllR3wYpjzHQJpKEQ/w680/unnamed.webp",
"Description":"Plague Inc. is nothing more than a fascinating strategy for Android with a very unusual gameplay. According to the idea of the authors, the user controls the spread of a dangerous virus on Earth, using the possibility of mutation at the genetic level.\n\nThe virus that was originally created is very weak, and, having appeared in only one country, it begins to spread slowly thanks to people's contacts with each other. To speed up the process, you should pay attention to the so-called DNA points. They accumulate over time and are used to improve the performance of the virus, including the rate of spread, resistance and mortality.\n\nThe more people affected by the disease, the more DNA points the user will receive. But it is necessary to be very careful and follow the game news, as strong and developed countries respond quickly to the emergence of a new virus and begin to produce a vaccine. The speed of drug creation depends on the level of complexity of Plague Inc, however, on any of them, this process can be slowed down a bit by pumping special parameters in the Resistance section. The game comes to an end after the last inhabitant of the planet dies.\n\nThe graphics in the game are primitive and do not contain any interesting visual elements. The interface is simple and convenient, all game actions are carried out by touching the screen. Russian speaking users will appreciate the full Russian localization, including news feed. Plague Inc is an original puzzle game for smartphones and tablets. Despite the simple graphics, the gameplay is very exciting and can entice the user for a long time.",
"M":"Everything Unlocked",
"U":"January 16, 2023",
"V":"1.19.10",
"Link":"https://www.mediafire.com/file/hn5r2z278fdy526/Plague_Inc._1.19.10_Mod_By_Brotherz_Gaming.apk/file",
"Size":"81.61"},

{"Name":"Flip Diving",
"Category":"Sports",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiAIVVKsluH70bTMukJKKsxprnLtCheTSJLWeYV_RmyPdERIxY4waVXIgwd9knwLg1PkQ6Zlh0m8s9IMvQFh0BOSN94w-J8KbXvglka4ZJJHXKMd4qmurKRvtrP3I0Y0dajQtuB21RPmXoVy_I4LSBc4VJ72a7wC2G7cgUAf8U8rixl36FG_E526e3iMQ/w680/unnamed%20(14).webp",
"Description":"A sports simulator extreme jumping into water with ragdoll physics. Here the user will control various divers at various locations. To regularly perform a spectacular entry into the water, the player needs to train and get hand on performing flips and other stunts. Successful jumps will help to get gold and unlock new characters. Each character has their own characteristics and dimensions that should be considered when performing somersaults to achieve the best result.",
"M":"Unlimited Spins",
"Note":"Spins do not require coins or tickets.",
"U":"August 7, 2023",
"V":"3.6.30",
"Link":"https://www.mediafire.com/file/ybtochpervmvemp/Flip_Diving_3.6.30_Mod_By_Brotherz_Gaming.apk/file",
"Size":"125.66"},

{"Name":"Archery Master 3D",
"Category":"Sports",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjZJ945tVJ5pwOW_oYhdiwDeAj1x1SiTEfLnhuTedXV0Y9PruIIZ2goCd-bikSdvB8UN84m7cq-AFN9K8d4vbFf3BtImsuHjyo385xwuA0bojVcA3wYznARiv8koyHbNFonM-jJEQPH2PZtsWKDFvuWSTdEMwBE_WJQ9TRys2eK-FKG2lsioaG6u3m-8A/w680/unnamed%20(13).webp",
"Description":"A sports simulator in which the player will shoot arrows. The game will take the user to various real world venues with a variety of targets in the form of balloons, colored circles etc. to make a shot, you must pull the string, aim and let the arrow, watching its flight. Earning points, the shooter will raise their skills and will have the opportunity to compete in shooting with skilled opponents. Excellent graphics, detailed physical model of the arrow's flight and easy control will help you become the best virtual Archer.",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"3.6",
"Link":"https://www.mediafire.com/file/tyk3pyutgvua0qo/Archery_Master_3D_3.6_Mod_By_Brotherz_Gaming.apk/file",
"Size":"21.88"},

{"Name":"True Skate",
"Category":"Sports",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjCzrSeS1Rlc0ceoec9kARjT9cBZ6t5a08744p1uWiBMPZo5iL0408ktC3JxivWHvBpBK5fQ2AWuMNOoK9nEgiL2HhUlsuiqdbETopxcOyS0Vr1LvHwUXXttkAHOL7g9vm1Qqa_WkO_-7d-cgvH9b1h137aOzonIyjSvUzA--cizLymMyA9LQMmjLouIg/w680/1568091828_1.webp",
"Description":"A very popular game that takes you conquer different areas, which are especially prepared for skateboarding. Stand on your skate and go do the most dangerous stunts, push down on the floor and scatter even faster. By passing all the above, the game has a very gorgeous graphics and realistic physics that is as close to reality. Ride and spend fun time in special skate parks, as well as the game progresses you will open new skates, new parks and tricks that no one except you perform!",
"M":"Unlimited Money",
"U":"August 7, 2023",
"V":"1.5.65",
"Link":"https://www.mediafire.com/file/ivy90wfedt250k0/True_Skate_1.5.65_Mod_By_Brotherz_Gaming.apk/file",
"Size":"75.69"},

{"Name":"3D Tennis",
"Category":"Sports",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEjxXuP_RdsKIOehw7Rp1YPorVznNSlY1MW0PyEkMDj_APwiPyYS7hXevYZNpaNxQkiHPr-KGqJdw92KEwQErcB-rRR6fq8oGfV65uTsLTyFx1XVERQtxmthZMhkKazO82Yp3i_E4E-tDPlgf-I8fbxfmE3QsHwwU8NYC7sGMUIc0ePoZk1a9lMC33TNHQ=w680",
"Description":"A sports simulator of the inviting user to participate in tennis matches and Championships. The game features a great variety of courts with different coating, many famous tennis players, a few tournaments and great graphics. But the main advantage of the project is a convenient control system. The developers took into account the fact that, to play on the touch screen, so this will have to use only one finger, which is very convenient and therefore greatly simplifies the gameplay.",
"M":"Unlimited Money",
"U":"January 22, 2023",
"V":"1.8.5",
"Link":"https://www.mediafire.com/file/9i733auyp96zg8w/3d_Tennis_1.8.5_Mod_By_Brotherz_Gaming.apk/file",
"Size":"16.36"},

{"Name":"Wrestling Revolution 3D",
"Category":"Sports",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEi3Ego2YTFKQ4goF7Y83YJGaKXFim7K2PBByVpPqikPZ5qYPNlV2e2htsd40RHdEALFfvpGEl_pkWX63_CDPf_yqZHapcRV-TVr3wh1ZubHwTOUxsjPtmvjfH-0csg255li_gt1KTqQG_PEofIaBxaF7pxse-H_Hy1Lw8pZF9-YDoynUlmPPOidAu3Zig=w680",
"Description":"Wrestling Revolution 3D colorful simulation game staged fights on the Android device. Game about fighting without rules, under the auspices of WWE to mobile gadgets can be counted on the fingers of one hand, so many fans looking forward to such projects. Here the user is waiting for an uncompromising fight with the participation of pumped-up testosterone men.\n\nBut first you should undergo training, where an experienced coach will help to deal with management and fighting techniques. Then you need to find opponents who want to fight. The user has three different modes, including a simple sparring and fighting wall to wall. All fights take place with the use of improvised means: stairs, benches, and other utensils, trapped in the ring.\n\nThe gameplay here is very dynamic - never a dull moment. Graphics could be better: the unnatural shapes and the faces of the wrestlers do not look very good. Despite this, the Wrestling Evolution 3D game for its genre is pretty good and will appeal to fans of the WWE.",
"M":"Unlocked Backstage Pass",
"U":"August 7, 2023",
"V":"1.720.64",
"Link":"https://www.mediafire.com/file/okb0fewswc57n91/Wrestling_Revolution_3D_1.720.64_Mod_By_Brotherz_Gaming.apk/file",
"Size":"35.38"},

{"Name":"Game Of Warriors",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjZda4OXnJDPg50XRF_cA_7nk-hraFB1k5lt_E8Yifs36lBMCRzpZvrpoBIB8e_NpmOHa-aiCKtnW54N26Q1tnzKOR87mLs1fsiMMS9SVO08kRZN2Esf0EHgC01trYpd_oSFQQGf66sXvRoORlcx4KBb5w49wlLz7zFzEK9kXfIlKHYSMcOztdVlfx8nA/w680/unnamed.webp",
"Description":"A strategy game that combines elements Tower Defence and battle wall to wall. The player will have to defend your castle against the incursions of the enemy, sending the defence force. Also in his responsibilities will be to attack the citadel of the enemy. Along with a variety of gameplay and the project received the development of the characteristics of a hero. Complement it all a few dozen types of fighters, a lot of combat skills, a nice three dimensional graphics and a choice of four powerful characters.",
"M":"Unlimited Coins",
"U":"February 12, 2023",
"V":"1.4.6",
"Link":"https://www.mediafire.com/file/28wh2xfhaj91czq/Game_Of_Warriors_1.4.6_Mod_By_Brotherz_Gaming.apk/file",
"Size":"58.3"},

{"Name":"Kingdom Wars 2",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhl1DYwvTZuxabaeG3MC2Kh7m98FnLfvaQxjX7melfHeR5ICqFUciVQkV3GXEUKT80N-U5v7qFWpvX5-KvZzyGCGEbmik9DMoCs1c9I1Gt5YiXVPzmt848XXnUl2obCEmzH-ijjCvTky_vxkspQ2cyZ3xSBXm2Dz6nFVV3TtHxu3uik-HZl9vNiwduGJA/w680/unnamed.webp",
"Description":"A strategy game with exciting battles, offering the player to fight for influence on several continents. The user will become a commander, leading his wards in bloody battles with other troops, as well as with fantasy monsters. During the battles, the commander will be able to use more than a hundred available combat units, as well as several special skills. You can play here both in the story campaign and in the survival mode, while in various situations you will have to attack, defend and retreat.",
"M":"Unlimited Coins\nUnlimited Gems",
"U":"August 7, 2023",
"V":"5.1.0",
"Link":"https://www.mediafire.com/file/77naw5uypckpgsg/Kingdom_Wars_2_5.1.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"90.36"},

{"Name":"European War 6 1804 Napoleon",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgABIi_LbGwqUqIjwbEFDkfWK1q0ONkS1exm1oRuOb6CjYhhE5Dn3_CxQB-1LW7Tk345vX1_ZhCd6A3Dy754Cu4rrIOKNNyXBjyq90DfJODMFMULT-Xk1p40Rl6QMwW9hmqEyW_jmXujUR9h3DqAgmjol2qa66UJmIt7GH8NeEoJqYfWv1bE1BcOqnTiw/w680/unnamed.webp",
"Description":"A strategy game allowing the player to plunge into the events of the historical battles of the Napoleonic wars. The user is given the opportunity to choose one of the warlords and to start with them on the conquest. Napoleon Bonaparte, Mikhail Kutuzov and other generals are available here for selection. Only here, there are nearly a hundred historic battles, which are divided into ten chapters. In the process of passing you can pump the skills of your troops and assemble an invincible warriors.",
"M":"Unlimited Coins\nUnlimited Medals",
"U":"October 19, 2023",
"V":"1.3.4",
"Link":"https://www.mediafire.com/file/wsdm6w0frp77ubh/European_War_6_1804_1.3.4_Mod_By_Brotherz_Gaming.apk/file",
"Size":"83.88"},

{"Name":"WW2 World War Strategy Commander",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgqjpJ6kjCsfXaj1ywTSNUkCAdQJ3os4tvW7b2Ha0ZLFCfh5kOqeCMtOkiLb8JlmzEfMoZCA7iqKGyZ0dxkSv-iNirlRFUk9QhuGb5vhdZgiBJmfAEBHWX6RwbtzAj_5Ci2ZeQTtl1XOtLqxZ27wt9moNFJNebsj1GONZhnTfZIKcG_rJ20Y9Deu59eaw/w680/unnamed%20(3).webp",
"Description":"A quality strategy game with turn-based battles that unfolds during the Second world war. The player will be able to participate in historical battles that took place in various theaters of war. Using all available resources and technology, the user will have the opportunity to turn the tide in their favor and win. All gamers will find three dozen military campaigns unfolding in the seven regions. Also here you can join alliances with friends to fight against common enemies.",
"U":"February 5, 2023",
"M":"Unlimited Cash, Medals\nAll Generals Unlocked\nAll Troops Unlocked\nAll Units Unlocked",
"Note":"If The Mod Does Not Work, Run The Game After Installing And Wait Till The Game Loads, Now Close The Game And Clear The Game Data Once And Run The Game Again",
"V":"3.0.7",
"Link":"https://www.mediafire.com/file/dwgzh7mn01s0nga/WW2_World_War_Strategy_Commander_3.0.7_Mod_By_Brotherz_Gaming.apk/file",
"Size":"108.18"},

{"Name":"World War 2 Strategy Battle",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhzzuAQmnAJd5ducVGr9FKKi4fXVjNrj0CxaYChuwmG_kVBJK3Mu5tLVB_BNONEGVxuXsjXdPsAqEOYH2SXM5mDd5RPmHYWENQMSurJo2zHXdAaPFmWUnmsA2rrUNZOwaBpTflszc5q4uljicSUUY2jWBEkd-Weotlm5Yet3lGIoRSePOLhP0xiWWyGyQ/w680/unnamed.webp",
"Description":"A horizontal strategy war game, in the game, you can collect and upgrade soldiers, unlock arms, form an army, command battles, give full play to your military talents, defeat all opponents, and become the final winner! Super fun total war real time strategy simulator game, multiple arms are independently upgraded, and intelligent AI helps you fight on the battlefield. Reasonably allocate resources, grasp the rhythm of the battle, and come and challenge your limits!",
"U":"August 7, 2023",
"M":"Unlimited Cash\nUnlimited Medals",
"V":"459",
"Link":"https://www.mediafire.com/file/8co2hj12anhk23h/World_War_2_Strategy_Battle_459_Mod_By_Brotherz_Gaming.com.apk/file",
"Size":"489.54"},

{"Name":"World War 2 Eastern Front 1942",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEibv833pXo-VX9KTysyciH5KdrAE48XlruB1upAHa06FX4y70f0GQJ8ajTpk-Vbbam5CvwQXDh85i8Uueazp_WIoRNZYY8Q7kuYmWumP7lFHpRTTb0MY_0TTUlE_RaL6Vowd1nQkAVVaTCXWIszbCWoPR1gRCg7IFczJshGRzkm8rkLxIBFX_wbkxQZIA/w680/unnamed%20(1).webp",
"Description":"A military strategy that will immerse players in the vicissitudes of the Second world war. The action will unfold on the Eastern front, where he will meet Soviet and German troops. Users expect many battles that really took place in those years. The battle for Moscow, the battles at Kursk and Leningrad, clashes near Kiev and Minsk and many scenarios are available to the gamer. During the passage he is going to use various military equipment of those years, the player also will get acquainted with the tactics of the legendary generals.",
"M":"Unlimited Cash\nUnlimited Medals\nAll Generals Unlocked\nAll Troops Unlocked\nAll Units Unlocked",
"Note":"If The Mod Does Not Work, Run The Game After Installing And Wait Till The Game Loads, Now Close The Game And Clear The Game Data Once And Run The Game Again",
"U":"February 5, 2023",
"V":"3.2.0",
"Link":"https://www.mediafire.com/file/oit678hvthwm690/World_War_2_Eastern_Front_1942_3.2.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"87.46"},

{"Name":"European War 5",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg6Um9dDLgZqWbszsLIWCerX9f5FluMz9PGcdte2TTG51anwFPY4LeGg7PFaAe1X4yoPQtIzbo6TtAETc_V-2sMpZtf84-r5xFifUZEzprU4Id-KrW1NcIG42BA0El-cSK3kvwBZxYd9K2lap-wWu1OhQ9oEvWeNL1Cp0512utfca2TSasyPlsz1ERX0A/w680/unnamed%20(1).webp",
"Description":"An excellent strategy simulator for Android devices. The plot of the game unfolds in the distant past, in which the player will have to take control of one of the commanders presented in the game. Your task is to manage the army, keep discipline as well as develop unique battle tactics. Fight your enemies, score victories and get gold and other valuable resources. A large number of levels and epic battles await you in the game, and each successive era, will bring unprecedented prosperity to your empire.",
"M":"Unlimited Money\nUnlimited Medals",
"U":"February 5, 2023",
"V":"2.4.0",
"Link":"https://www.mediafire.com/file/oh1f207moa5e4j5/European_War_5_2.4.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"129.79"},

{"Name":"European War 7 : Medeival",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgNSHxAcUIacySXMvCUedOBeSC4TvxIjaqYrMTNKW8gImLIEvmwQTV6Tr1ScsRRtM2Ez-6Mk2dencghX79R5ZtPYPnjdqNbjvsiDrHbiBF7kPr6IHYZ-9nWqyxjnEwOk9dz2_E5D0kpj-65qAEtZdTyk8-YyL2C6tQ1eGRPXPZcPIOdj14io9ZDcLckSA/w680/unnamed.webp",
"Description":"A strategy game allowing the player to take part in many exciting adventures and discover many new lands with many new things. The game brings a series of very exciting and dramatic battles, and many different cultures are created to bring you more unique and exciting experiences. Not only that, but European War 7 Medieval also gives you countless talented commanders and a number of powerful armies. Players can enjoy a very unique and attractive entertainment space. Enjoy countless maneuvers and strategies in this war game, live the history of the Middle Ages and create your own epic. Fascinating stories based on historical incidents, such as Rise of Byzantium, Viking Invasion, Burning Crusade and Hundred Years’ War, transport you to the war-ridden Middle Ages.",
"M":"Unlimited Money\nUnlimited Medals",
"Note":"Play Only Without Internet Connection",
"U":"December 13, 2023",
"V":"2.4.0",
"Link":"https://www.mediafire.com/file/47kabxq1bkfza4j/European_War_7_2.4.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"402.70"},

{"Name":"World Conqueror 3",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgwzy3CEOX_zoTfP9RxoXJR8kBtlOXtmp8usLwvtQ2UWrsBkxwRtiW1APDB0VMUvGiE94NWBv3KgBbcWzaClHVFthfm8DnlQYfgPXyFt29Pwzm0IIjSvrp1IVf5ve_7Ejy4V_FOJoFgH9XqK6DYZVn_bTD2muFp5bYOgpEAV9XzKWF0dfQ9DWOhiYkchg/w680/unnamed.webp",
"Description":"A global strategy covering three periods of modern history. The player becomes the head of one of the 50 countries, will be engaged in the manning of the army and led it in battle. Participating in one of the three military campaigns, the user will participate in large scale battles and change the course of world history. This will help him all kinds of troops, tactical thinking, and discovering new technologies to make a qualitative leap in the development of weapons and equipment that will become the decisive argument in the hostilities.",
"M":"Unlimited Industry Points\nUnlimited Energy\nUnlimited Medal Points\nUnlimited Tech Points\nAll Premium Generals Unlocked",
"U":"June 2, 2023",
"V":"1.8.0",
"Link":"https://www.mediafire.com/file/w631s4dsholsplv/World_Conqueror_3_1.8.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"90.22"},

{"Name":"European War 4 Napoleon",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjfbhsYYj_IFKRngT6PKfPXeQPiRdz2cnpfC6U0sXMIQX0acSSyZt-3nfAT6N3FBCkEr_BRuN3taSTIDTb8h3_izHMZmpskcECM7l-70mtUaoa7DFxKa9RlZJtLWx1XDA-sggxRSxCXbEDheV7ok9knSIJKbY6VrQUNl8i3yJBmYvOS_tJEsT1DDR--ng/w680/unnamed.webp",
"Description":"A global strategy, which takes place during the Napoleonic wars. The player has the opportunity to participate in a historical military battles of the 18th century between Napoleon's army and his opponents. Users will meet many historical figures, including the Bonaparte, is also famous for the generals in the face of Kutuzov, Nelson, Washington, etc. At the disposal of gamers will be several dozen unique units-fifty skills, as well as 42 States on the map of Europe that you can grab.",
"M":"Unlimited Medals",
"U":"August 7, 2023",
"V":"1.4.42",
"Link":"https://www.mediafire.com/file/xsebdaht5slx0jb/European_War_4_Napoleon_1.4.42_Mod_By_Brotherz_Gaming.apk/file",
"Size":"73.95"},

{"Name":"Alien Creeps Td (V1)",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEgITIwuldwmDGUmOiA1ZUax8yRPoOro304LGkqP7I-E7Uwote4psHERo7s6BOmOObvs5Q6ApI6gT8dUtkPJ717Ts3YTQij58gT9RSyh6T5HiLogOftrzOmRmuSI1vyI3TbI4lcE5JZg8tKoEy6JYOg-6kzDS4k2qNcxifJu6gUFw6y7DpJTR7R9kPQvbg=w680",
"Description":"An excellent game from the genre of tower defense, in which you will build your large and secure base, and create defense lines from alien creatures. Who arrived on our planet, and obviously not with peaceful intentions. Beat out all alien attacks and give them a worthy rebuff, Do not miss a single enemy to your base. The game has a very good and modern 3D graphics, as well as excellent management and extremely interesting tasks. Become the commander-in-chief and show the invaders all their skills and brilliant tactics.",
"M":"Unlimited Coins\nUnlimited Gems\nUnlimited Support Items\nAll Heroes Unlocked",
"U":"December 13, 2023",
"V":"2.32.4",
"Link":"https://www.mediafire.com/file/an7vvdtdprf9ghh/Alien_Creeps_2.32.4_V1_Mod_By_Brotherz_Gaming.apk/file",
"Size":"135.31"},

{"Name":"Alien Creeps Td (V2)",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEgITIwuldwmDGUmOiA1ZUax8yRPoOro304LGkqP7I-E7Uwote4psHERo7s6BOmOObvs5Q6ApI6gT8dUtkPJ717Ts3YTQij58gT9RSyh6T5HiLogOftrzOmRmuSI1vyI3TbI4lcE5JZg8tKoEy6JYOg-6kzDS4k2qNcxifJu6gUFw6y7DpJTR7R9kPQvbg=w680",
"Description":"An excellent game from the genre of tower defense, in which you will build your large and secure base, and create defense lines from alien creatures. Who arrived on our planet, and obviously not with peaceful intentions. Beat out all alien attacks and give them a worthy rebuff, Do not miss a single enemy to your base. The game has a very good and modern 3D graphics, as well as excellent management and extremely interesting tasks. Become the commander-in-chief and show the invaders all their skills and brilliant tactics.",
"M":"Unlimited Coins\nUnlimited Gems\nUnlimited Support Items\nAll Heroes Unlocked\nAll Levels Unlocked",
"U":"December 13, 2023",
"V":"2.32.4",
"Link":"https://www.mediafire.com/file/awh3go79qdb3bqx/Alien_Creeps_2.32.4_V2_Mod_By_Brotherz_Gaming.apk/file",
"Size":"146.39"},

{"Name":"Grand War : Rome",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgZ8VHJN7Y4Uk5S3bQSrXYBjGMGmF9pm7zKmo2ZUcm9RkwB7IYpj0t44qLpI1FCjsyJkRJlIE4jX1ZERQd14s1Sk4op_2ut2vy-A1uBJhjbRPXQOBpslnlH6-fwKTMnmQEoDth_n7o170VqishFMESMoiQlvFnbkQ_ENW0izpobRza0yTTvlyEjh-Xfnw/w680/unnamed%20(1).webp",
"Description":"Rome Empire War is a classic turn based military strategy in which the player will lead the army of the Roman Empire. The user is waiting for several campaigns, during which he will have to control the army with the help of well developed tactics and defeat the forces of opponents. The commander will have several types of combat units to choose from, each of which is suitable for a certain type of battles. In addition to participating in battles, the player will also have the opportunity to get acquainted with such legendary historical figures as Gaius Julius Caesar, Hannibal, Scipio, Carthage.",
"M":"Unlimited Gold\nUnlimited Silver",
"U":"October 19, 2023",
"V":"708",
"Link":"https://www.mediafire.com/file/1gixlne7x4c2rby/Grand_War_Rome_708_Mod_By_Brotherz_Gaming.apk/file",
"Size":"431.33"},

{"Name":"World War 2 : Europe Frontline",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiZLYdrJH7qpphM7_gUR3u1DVOfn7zEDrza8DH0LYY9dk1UWBX9Hv2JQI6qWnz3lxiM19JAxMoHTY933Euij1GB7W746zpF053lRgZAUc5EkXKEq4rvCvW76XWd4tgNSJjj9k6yyJGR7SUol8gD-xeFJvQoDTFXmYEJaJfoRdcjO_c78ssr3BdqQWBIJw/w680/unnamed.webp",
"Description":"A historical approach to the subject of the Second world war. The player can participate in hundreds of military campaigns that unfolded in all corners of the globe during the period from 1939 to 1945. Join any army that participated in the global conflict. Depending on the user offers unique missions, different military equipment, and knowledge of the great commanders, which will help to identify weaknesses of the enemy.",
"M":"Unlimited Money\nUnlimited Medals",
"U":"October 19, 2023",
"V":"779",
"Link":"https://www.mediafire.com/file/yrxnltkc1vkgd99/World_War_2_Europe_Frontline_779_Mod_By_Brotherz_Gaming.apk/file",
"Size":"277.06"},

{"Name":"Last Hope TD",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhCnkPyKgLUHwDZnVFJkvpn9x6a-dOOx5NlsrK3LbthNGfLDP3nVUkawW4h_qZPwCDgH9bzoOWKyVayQ3S5ZhA0SDvwa7fKEF6vG93vqhFg1FeW4HuvXjg_Nf7ANCzbwjHW6LDzt4Rumq9CXPVZfxWhvT9mI9r3GGHOcIVLbfrd7t9QLaM8CLWNlKLsXw/w680/unnamed.webp",
"Description":"A strategy type Tower Defense game on the theme of a Zombie Apocalypse. The player will join the heroes who managed to survive in this meat grinder. However, this is not finished, because the walking dead are coming from all sides. To destroy their waves of attack, the user would have to place various turrets in the path of mutants and to use the skills of the characters and their weapons. Correct tactics will help not only kill normal zombies, but also to resist the more powerful bosses.",
"M":"Unlimited Money",
"U":"February 5, 2023",
"V":"4.1",
"Link":"https://www.mediafire.com/file/6vklb5egcwxhmbt/Last_Hope_TD_4.1_Mod_By_Brotherz_Gaming.apk/file",
"Size":"156.01"},

{"Name":"World Conqueror 2",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi5ZalTJq60JPc4j_ydVggRN1ShT-NFfhv_ZQfINhlZ2sNwZEJ5NcbX216vhF2i_MBc3uPnfUbp54QsXns68r7JqboOM7Q62kHDuGvY3c9WKMRprjpYn7cno8tb6s7mx_u_iX7ZZ9sPWFTTIQ09pRMVAV51PgfKHqU30D-5DT8BFvHpfVKr_VEjMfXCtw/w680/unnamed.webp",
"Description":"A global strategy, which takes place during the Second world war and the Cold war. The user becomes a direct participant of those events. It will have a variety of combat units, several dozen historical campaigns, and the most famous generals. After choosing sides of the conflict, the player can choose the commander and to get used to his role. Douglas MacArthur Georgy Zhukov, Charles de Gaulle, Erwin Rommel and other generals available here. The project has a good artificial intelligence of enemies, nice graphics and gameplay that will appeal to fans of the genre.",
"M":"Unlimited Medals",
"U":"February 5, 2023",
"V":"1.3.12",
"Link":"https://www.mediafire.com/file/vbekc3kid4991k5/World_Conqueror_2_1.3.12_Mod_By_Brotherz_Gaming_sign.apk/file",
"Size":"85.55"},

{"Name":"Glory Of Generals 3",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh_EKycCGrMJgTk-NoQopx6zlNRUhZOMX52wqrafHEONFlRl_Mk90WTCuuZRWLGFbVPclb8TdbmFOeZMZYMolLgfEiKWEB3XYgDVUES9c8ndTQsK-14h8cLO9xS3hOI9BTDX0IxEYXqXCRQtS60s_TqxieRY-OULsA9Y3Lg0YeaUCTbwUDy4l-s76G4kQ/w680/unnamed%20(1).webp",
"Description":"A global turn based strategy in the setting of the Second world war. The player will control armies in land, air and sea battles of those years, characterized by historical accuracy. The user will be a lot of military units, various appliances. Each unit has its own features and benefits than to use in combat. In addition to these tools, the gamer will be able to enlist the support of more than a hundred generals capable of their actions ahead of any opponent.",
"M":"Unlimited Money",
"U":"October 19, 2023",
"V":"1.7.4",
"Link":"https://www.mediafire.com/file/scqwl8sd4tz8v7x/Glory_Of_Generals_3_1.7.4_Mod_By_Brotherz_Gaming.apk/file",
"Size":"76.51"},

{"Name":"Steampunk Tower 2",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEg38Im0L6LJF_Z9bCyB5uQWT0S9_TUzMrdrGBdio8zkZD6CBpnEoNDq0ypXQxw-y1y2j2H6-f4J8q3ejiRzM6vz8OpBtA46ezNOmx9L6TN2xPO6J35pMN_KMB_qyz8B5tfVg0A3WYEQKdkOrPXFqDJc3wkkh3MJ8mKN_IfldCARsWoJSvNj5rQbREAQYA=w680",
"Description":"Continuation of excellent strategy, in which the main character, Lord Bingham will once again need the help of the player as commander. The game is built on gameplay the principle of Defense Towers. The user will be the head of the air cruiser, equipped with a large number of equipments produced by technology of steampunk. Each equipment will help protect the city from attacks of enemies. In the process of passing a gamer can strongly improve the available tools for effectively countering the enemy.",
"M":"Unlimited Gold Coins\nUnlimited Gems\nUnlimited Etherium(Increase When Spent)",
"U":"February 5, 2023",
"V":"1.1.4",
"Link":"https://www.mediafire.com/file/uuivw1wpl3d4szu/Steampunk_Tower_2_1.1.4_Mod_By_Brotherz_Gaming.apk/file",
"Size":"97.84",
"Note":"Mod Will Not Work For The Purchase Of Gold Coins And Etherium In The Store 'Resources'."},

{"Name":"Grow Empire : Rome",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj0mltr4vK-tqVZSx1kiFeawR7T8akt8GIEU8UN11oVLelNeIruysEMM-NMTxsGOowvMPNOGZmrXWGS5btnhHxjvpPntVjni_CBITj5cNYRS3UEDSxjJa_A4YiNH_gWSGYa4LR3PuDxqjnsnJeVpD6c5Dl38cehgb_PzxSsP03ypFQCyuTM-Hl18BafSQ/w680/unnamed%20(4).webp",
"Description":"A strategy, which will play not just for anyone, but for the most Julius Caesar. The famous Emperor wants to conquer all the peoples of Europe and make Rome its centre and stronghold, and you want to help him in this difficult matter. The player has a large army consisting of archers, infantry, cavalry, and siege towers. Also there are about thousands of buildings and structures that may be erected on the territory of the Empire. With such resources, the commander can conduct many attacks and capture 100 major European cities.",
"M":"Unlimited Coins",
"Note":"Coins Increase When Spent",
"U":"December 13, 2023",
"V":"1.37.3",
"Link":"https://www.mediafire.com/file/732a5i9nxyc9o96/Grow_Empire_Rome_1.37.3_Mod_By_Brotherz_Gaming.apk/file",
"Size":"97.09"},

{"Name":"Kingdom Wars",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg_9xurpB-QmBfZ0VkWuyYkZYvP2MJ2e20RuzDA_ytUli2rNoEqy5UYTT3FCrL0HfFRVVbjZrKEonL7V6GIeDl2ogzxHLNiqqphRhYDeLHsZJVGzYANuoiwPa-qTLF6SNCkXC7YSjRa0gcOCpnrCW_xCW-TyYy_uS9lHJywPG-HktKRKqM1Yg1mDAnPaw/w680/unnamed.webp",
"Description":"Strategy type tower defense for Android devices. Her Kingdom was under attack guests from the dark world. Now it is in deadly danger and only the player can solve this problem. To do this, he will destroy the perfect the enemy using defensive structures and combat units. They will confront demons, undead, dragons and other monsters. Each type of soldiers and towers has special abilities that will help in the fight against otherworldly forces.",
"M":"Unlimited Money",
"Note":"Diamonds increase when spent, purchase coins in exchange of diamonds",
"U":"February 5, 2023",
"V":"2.9.0",
"Link":"https://www.mediafire.com/file/oojesxpw7lixip4/Kingdom_Wars_2.9.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"52.23"},

{"Name":"Tower Conquest",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgQaJPFV4rHnA8XiiWx4bfBHHoHXHuCW8GLQoIXPQ3RkF4qx0IL-PlOL3Q2ZdpKEIULvHEJb78FxHG4XyGYYfQpC505w3I48ulUGy_ccQgoVDO2W59ra3-XFEASkielQS-XtUQYU1E3rVuZNnlu1ftZf0LEjBrVbRabwXcDMLPZSFOx0kkNBEgoSdYknQ/w680/unnamed%20(1).webp",
"Description":"Tower Conquest is one of the best Tower Defence strategy, where the battles take place wall to wall. In the story, a resident of the village stumbled upon a portal to another world, from which then pushed the hostile evil spirits. The gameplay here is simple.On the left side of the screen is lock user, whereas the stronghold of the enemy is on the right.\n\nThroughout the entire process in the Treasury of the player would drop your main resource, mana. Due to its you must hire peasants. They are armed with pitchforks and effectively confront living dead. After the destruction of the enemy forces, the villagers are sent to destroy the enemy base. Victory give valuable gold and provide more efficient types of troops.\n\nAlso the success of further use of various magic spells during the battle and upgrade features of the army and the castle. Tower Conquest is one of the best representatives of their genre. There are a variety of units, beautiful locations and exciting gameplay. All this makes the game a real gift for fans of the Tower Defence.",
"M":"Unlimited Coins\nUnlimited Gems",
"Note":"Coins And Gems Increase When Spent",
"U":"February 5, 2023",
"V":"23.0.16g",
"Link":"https://www.mediafire.com/file/gccyhvz7f8al5jm/Tower_Conquest_23.0.16g_Mod_By_Brotherz_Gaming.apk/file",
"Size":"131.61"},

{"Name":"Digfender",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg9kzSvyJF7c9KBEGGH1PU783guoFwEBpzDfih5dbQUyRPjBHQG3yFDqYxsEPUS2iIbp9l3ISey6kadI2MCZtxbF9f8kRFohGN8fUet1tXXE9Eew6zaOdxecvsjREok8QfKMxrKx3hFT0sm-_R4866iX8BaAhimjLqubCLS1yG3_LyefECaFgXfcXZwZw/w680/unnamed%20(3).webp",
"Description":"A strategy game with elements of Tower Defense subgenre. In the story the user will be engaged in excavations numerous treasures under the ancient fortress. This place is rich on things like that, but production of treasure awakens ancient monsters begin to get out. To stop them, the user will have to build defensive towers. In the process of passing a gamer will improve as the tools for production values, and defenses through a variety of upgrades.",
"M":"Unlimited Gems\nUnlimited Stars\nUnlimited Relics\nMaxed Tower Upgrades",
"U":"February 5, 2023",
"V":"1.4.6",
"Link":"https://www.mediafire.com/file/9tkyzjhf7eps1l4/Digfender_1.4.6_Mod_By_Brotherz_Gaming.apk/file",
"Size":"69.76"},

{"Name":"Stick War : Legacy",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEjxEA1TzhZdR4w_t_VFIk4fjOOn34n1i48Opx6vfBqoCotWPKDSGJ2dcotF4QIG-LPqcuNYl0slPzp8wyKvCSKscY3dJ4S9LzveqK6_-x2oNasE7mdI3aHW2t0GvQQ13x6YC7ScFEYRS-GgFhi90RZqhHBQTCqDbrSEuMZ5hyIajfBLmebdqvAcPsFFhg=w680",
"Description":"A strategy, which will have to manage an army of thin men - stikmans. This hero is very popular and visited many of the games of different genres. Now he has reached and strategies. The main objective here is to capture territories, create and improve settlements and army.\n\nThere are three levels of difficulty depending on which game process becomes easier or harder. As in any other similar strategy, there is need to establish a camp, recruit troops and labor and to extract resources. There are story quests, for which performance accumulates gold and experience. You should also fend off enemy attacks and to attack. The player must not only demonstrate the talents of a politician and the commander, but also to upgrade weapons, soldiers for the most successful course of battles.\n\nTimely upgrade skills and weapons will give a distinct advantage in the struggle with the foe. Stick War : Legacy is a great example of a strategy that combines the familiar gameplay and unusual characters. This mixture will appeal to fans of the genre and fans of games about the thin men.",
"M":"Unlimited Gems",
"U":"February 5, 2023",
"V":"2023.1.3",
"Link":"https://www.mediafire.com/file/9p46u0g2ouc89d8/Stick_War_Legacy_2023.1.3_Mod_By_Brotherz_Gaming.apk/file",
"Size":"112.3"},

{"Name":"World Conqueror 4",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj6lxEjflAvjYY4NsaBO1WOoXSl1p0LxzUjlcbx43Y1oL5pToJkakYjSU6Ai2NymUuL7fAc4DI0FzdASPad5100sA4bXWXL0KcIKAZvZsgG5iWWbVEZq2VmDp0Hi_tZZwD30r8Kb3BupojwpQ-JWcdmJ8zqNxzKfKdmr-QM-Fy6HdTwTkUuQ9ukLwZZNw/w680/unnamed%20(2).webp",
"Description":"Strategy for Android-devices in which user will become the captain and take direct part in the war. Choosing one of the countries-participants of the conflict, the player will begin the ascent to the heights of power throughout the world. To achieve success it is necessary not only to have efficient army, equipped with appliances, but also to establish diplomatic relations with other States. Also to help commander comes with many famous generals, each of which has its own strategy of warfare.",
"M":"Unlimited Coins\nUnlimited Medal Points\nUnlimited Industry Points\nUnlimited Energy\nUnlimited Tech Points\nUnlimited Military Points\nPremium Generals Unlocked",
"U":"November 21, 2023",
"V":"1.9.0",
"Link":"https://www.mediafire.com/file/vbn5zw49cx4q9xv/World_Conqueror_4_1.9.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"108.84"},

{"Name":"Archers Kingdom TD",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjtpv4jpFjHHfT-ZuDThNJk0DU_fa50Vg8yLQq0Nnu8ZVU9gaA_IhfUTk4PeZJHd2EB0ufqDZuB_o6ltx1NizITAlbrD8vexEvxDJ1m9O2CSi61qFu8BDV6yk5CvF0Se8v3-sf12XKrUquL7C17cgBL7t4PmQkqRle0q58hSzWpjg_kXYypPFdMqkVxDQ/w680/unnamed.webp",
"Description":"Strategy type tower defense, where players have to protect a castle under assault by the skeletons and their evil master. Appropriate to destroy the enemy forces, you need to place towers and shoot skeletons from the bow the different types of arrows. There are many types of defensive structures, ranging from the catapult and ending with barricades and ice towers. All buildings can be upgraded, which will allow even more successfully to withstand hordes of enemies.",
"M":"Unlimited Coins\nUnlimited Gems",
"U":"February 5, 2023",
"V":"1.2.15",
"Link":"https://www.mediafire.com/file/qkyi6rvgnqwrp4j/Archers_Kingdom_TD_1.2.15_Mod_By_Brotherz_Gaming.apk/file",
"Size":"71.41"},

{"Name":"Steampunk Tower",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEj2yy6ZKbq7ysXMlJGYL-XJh6YeArM4kuuU916fIjGoqblPVO7YiM8qCFgP4PQV8ezktbaZ-65UHLauybq7ktKIFJJavfC3KUAPwphcGVS1EDrzmd8TOSGfK5OBBUXGJxvDdMmKS1krQeB8lFoCXmy4c3fWaR0Y1Id3vj_U74Qnr0EEtLGVsfjoLLprKw=w680",
"Description":"Take charge of a huge steampunk tower and help the eccentric Lord Bingham protect his precious Etherium. Strategy in the style of the genre Tower Defence, which brings with it some fresh ideas. The game itself sends users to the culture of steampunk that should appeal to many gamers. The gameplay is to defend standing in the middle of the screen tower. With two sides to it come the enemy that must be destroyed. To do this requires by means of guns mounted on floors of buildings. In the process of passing the player will finish the floors and put them on the new guns, while the number of attacking enemies will increase as well.",
"M":"Increasing Money",
"U":"February 5, 2023",
"V":"1.5.6",
"Link":"https://www.mediafire.com/file/2f1c1ry5a0uh4qd/Steampunk_Tower_1.5.6_Mod_By_Brotherz_Gaming.apk/file",
"Size":"60.16"},

{"Name":"Plants Vs Zombies",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEingkvsecxgmYPZz3XRs2Wb29fv8AYsUajUJGecuBP9BrVpbp9IXUHDQfuWpSxio27Lfjsl7YN_BtPW8r_GLzVPNaOTIu7jAypplyxP6yLPHniaPvJ-bpx7S0WlIRCrS8nBowDP0h1UKie5SXnIUzp-3qPkwZSdcYr_YJbf2ksLpqbZWOXtcGnLKgaPCQ=w680",
"Description":"Battle with the mobs of zombies in a new and exciting battle. Fight off all attacks of the dead, and do not let them get into the yard. Create your invincible defense, think through tactics and build protective nuts, which for a long time will stop the advance of opponents. The game Plants Vs Zombies mod apk has good graphics and a large number of tasks and a variety of locations. On which you will meet many heroes, and as you progress through the game you will discover new plants that have unique abilities.",
"M":"Unlimited Coins\nUnlimited Suns",
"U":"August 7, 2023",
"V":"3.4.0",
"Link":"https://www.mediafire.com/file/swh5s3k0s3n7b7t/Plants_Vs_Zombies_3.4.0_Mod_By_Brotherz_Gaming.apk/file",
"Size":"98.21"},

{"Name":"Castle Creeps TD",
"Category":"Strategy",
"Image":"https://blogger.googleusercontent.com/img/a/AVvXsEgOeGC_sqF-hJaycxk4g3nBfbyyn-b2gJO2_mjyqhlD1_ri7JilC-8TxldC9o2F92fK4M0uvyI_Eips3WgyVgOCxEGgATy4sw7pKEHlshE6tAPa2H6TqSzt2yQbn7fK2ytxbKxwnzXl4l_3cyPVb_VteHhhh9tt-ek3TEoCctGs-ZOTuM59WBzBKKIfYg=w680",
"Description":"Very interesting tactical strategy in which you need to defend your big castle and not miss opponents in their possession. In addition to the construction of towers and improvements you are given a unique opportunity to use characters with a variety of super powers and super powers. Available as unique buildings and towers that you can build only for the resources that have been collected on the playing field. Beautiful graphics and a large number of tasks, familiar and intuitive control, a lot of enemies and heroes are waiting for you, create your kingdom and become the most powerful in the Castle Creeps!",
"M":"Unlimited Coins\nUnlimited Gems",
"U":"February 5, 2023",
"V":"1.50.1",
"Link":"https://www.mediafire.com/file/iqwqb4df19xrqz4/Castle_Creeps_1.50.1_Mod_By_Brotherz_Gaming.apk/file",
"Size":"99.69"},

{"Name":"Parallel Space",
"Category":"Tools",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiA-eZ5K_OTU0Nz10zbgS1tn-jOuqgOU1aQeSfBrXVbZfWOq4tF3hw_yxV0n7UhhARroUByzUuZyphZ5Q8-kPEVAZoa52TXTU6PxhCmUobf1NOVpY8PaOr0PpvWs1N8UeZKXXWE4qFSms6an_87WMU9h8eimdc-OKG61ZJ1p53qfVo2HLVI86ju5trHEA/w680/unnamed%20(8).webp",
"Description":"A handy utility for mobile devices on Android to create clones of applications for entry of them under different accounts. With its help, any user has the ability to make an independent copy, and at the same time to be in the same program with different accounts. The application functionality does not change, and his work will be stable. This feature will be very convenient for those who constantly uses a variety of social networks and email.",
"M":"Null",
"U":"April 16, 2023",
"V":"4.0.9313",
"Link":"https://www.mediafire.com/file/53avn1epyjqoc5k/Parallel_Space_4.0.9313.apk/file",
"Size":"17.82"},

{"Name":"Parallel Space 64 Bit Support",
"Category":"Tools",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEga4Mr9XUZoV2VHLlYrSTbAr2GTfurINRExKph-Bc1vHRhPNDm7maepBw80_FDzvR6rHnGgZw20v_3yahx_UTrajJzm5V-GAmN8eEbYDNgdAz2Z1waKHVnqkc2-4d21J5Bx7G9_hl0RZlbEkyStuX_aeojcQukL4Lx48HVVxR3zpEXh5ovE2mDmcQHt1g/w680/unnamed%20(10).webp",
"Description":"Parallel Space 64Bit Support is a plugin for Parallel Space that lets you use this popular app on 64Bit devices, although it's important to keep in mind that this plugin doesn't offer any additional features. Its sole purpose is to help you use this app on the aforementioned smartphones.",
"M":"Null",
"U":"April 16, 2023",
"V":"1.0.3095",
"Link":"https://www.mediafire.com/file/e9fuv7vn16138bl/Parallel_Space_64_Bit_Support_1.0.3095.apk/file",
"Size":"831.64 Kb"},

{"Name":"Lucky Patcher",
"Category":"Tools",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiH1OChzy1y9WmqOU4Ia_JjIdMtsv82mvkzUsXJtLs7_666IeH76KeEWfpAviVWw5JmqVHSPdQF9UfX0ochK-tJgKUXaS5fThdsUThbdcd1cc1Y22kItTYT3vyvz57ImIQucjdRsMi4oemZMdw2jS5pvjpkm0234Trnon7--fipKR-Gl0IiUr5UL1RW2g/w680/1585554877_1.webp",
"Description":"Lucky Patcher is an android program that allows you to use the full version of many applications without buying a license. It's no secret that most games and utilities are only available in demos. And in order to use all possible functions, you need to purchase a key. But now you can bypass the system and gain all the privileges without spending your own money.\n\nAfter installation, the program will scan all available applications on the device and display their full list. In the upper part, those of them (and highlighted in color) that are available for 'treatment from the license' will be marked. It will be pleasant also that thanks to Lucky Patcher there will be an opportunity to launch in offline those applications which earlier demanded connection to the Internet.\n\nEasy control, intuitive interface - these are the parameters taken by the developers as a basis. Scanning applications takes a minimum of time, like applying a patch.",
"M":"Null",
"U":"April 10, 2022",
"V":"10.1.2",
"Link":"https://www.mediafire.com/file/oqjvndef9psux61/Lucky_Patcher_10.6.7_By_Brotherz_Gaming.apk/file",
"Size":"9.99"},

{"Name":"X8 Sandbox",
"Category":"Tools",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhOehpxTONMjg_EseYJmXIXaAe98i8mXEXJgCIZxIhCNc9VqfBJ9_dk2k0C7Ez3aDgzkTXzmFCgSB2AWct7pOu6MfffK-AewMNlFzw87hEfoOmrsaxKSo_0jRf1d4zq0whUrHop3hYSi9jCsRO4dU6x219ZiSIMqiafvAyysi1oopHmU6n4jCseU6qosQ/w680/ic_launcher_foreground.png",
"Description":"Most game modification tools require root access to Android phones. The X8 Sandbox is a tool that provides root access to applications commonly used to edit games. Essentially, this application is designed for mobile game penetration testing.\n\nThe X8 Sandbox allows you to install apps that require rooting without rooting the device. Because rooting your phone is not good for your device's warranty.\n\nThis application creates a virtual area to run applications that require root privileges. This is a very simple tool that anyone can use without changing anything on your phone. So no need to worry about using it on your phone.\n\nA virtual machine is a program that works like a virtual computer. It runs on the current operating system - the host operating system - and makes virtual hardware available for the guest operating system. Guest operating systems, like other machine programs, run under the windows of the host operating system. For guest operating systems, the virtual machine is displayed as a real physical machine.\n\nYou can install multiple virtual machines on a real machine and are limited only by the available storage space. Once you have multiple operating systems installed, you can open the Virtual Machine program and select the virtual machine you want to start, start the guest operating system, and run it in the Host Operating System window, or run it in full screen mode.",
"M":"Null",
"U":"July 25, 2022",
"V":"0.7.6.2.09",
"Link":"https://www.mediafire.com/file/og9hjy4rcr1exu2/X8_Sandbox_0.7.6.2.09-64gp_By_Brotherz_Gaming.apk.apk/file",
"Size":"359.14"},

{"Name":"X8/F1 Launcher",
"Category":"Tools",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj8_WuFwbMbG1fTPfkQALL3UgdBT3hUfoZ9NtHjgzd6Aq9KRDzEeCVzKBeYggr5QRsuxWh8TYFl6WZZGRdmRkp5nxURgcqZbpXfCpZutABBGmNu6V9tfhz5Yo72VVJP13g1dtLpnjogl4iW5cMqWUHgtCqBbRG1c9CSEvXi95_rW9xrsb2ctDX0EHuUjw/w680/ic_launcher_foreground.png",
"Description":"The main reason why X8 Sandbox is not working in Android 12 is because the Android 12 system restricts background processes, resulting in the X8 Sandbox not being able to start, running stuck and other problems. Therefore, it is necessary to remove this restriction through the X8/F1 Launcher.\n\nAfter installing the X8/F1 Launcher, Open it and click on the Repair button then follow the steps below.\n\n1. Connect your phone to WiFi.\n2. Open the X8/F1 Launcher, and according to the prompts, activate each permission switch and watch the video operation.\n3. Go to phone settings-Developer options-Wireless debugging-Use pairing code to pair the device.\n4. Slide down the notification bar to see the input box of the notification bar of the x8/F1 Launcher.\n5. Enter the pairing code just displayed to complete the pairing.\n\nAfter successfully repairing once, theoretically it does not need to be repaired again. If the X8 Sandbox is still stuck or running in the background is unstable, you can try to activate it again.",
"M":"Null",
"U":"July 28, 2022",
"V":"1.4.2",
"Link":"https://www.mediafire.com/file/6gobb4gywwlbavb/X8_F1_Launcher_1.4.2_By_Brotherz_Gaming.apk/file",
"Size":"3.55"},

{"Name":"Game Guardian",
"Category":"Tools",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiYzZ4ll2fFjcyYzCZEhdqBWWTg3dy1pbbd-5ZT9-3Syt4mAemceF66oxxDBRN1IFCVw6oCK6A_3gZ8YFWzr6tMGkISwGA8IpmHoX-ZRkqwwI3ydCKJuKwGUzj1J2Xes9p4ORLsa0S8qtNC_1Kdg5Fw_FdB18fu7EHMu0NZZnUPWAcKEBBcvt3IdFaHWA/w680/1585582963_1.webp",
"Description":"Many of us often used the Art Money program to youth. Therefore, the principle of the application Game Guardian for Android will be clear to virtually everyone. It is very easy to use and simple program that replaces the numeric values defined in the application.\n\nAll you need to you could easily work with the app is root access on your tablet or smartphone. The principle of operation is the easiest. You enter the value in the game that you want to change. The app finds it and changes for the desired number. The big advantage is that it successfully works with almost any game on your device.\n\nAs you can tell, the possibility of using the program Game Guardian is truly endless. You can assign your characters a millions of gold, resources and much more that you sometimes need in games. The most important thing is to make sure the application has been installed on your device memory and not on memory card.",
"M":"Null",
"U":"April 30, 2022",
"V":"101.1",
"Link":"Null",
"Size":"Null"},

{"Name":"Adobe Photoshop Touch",
"Category":"Photography",
"Image":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgHhtZqwHG45GpS-h6GvmI0xqUEaB43yGDw8cXoUC3GECr3BMWo11c0glSEndG0UVbREdWzkd_xhjAjEt7jqAiwxun6WNhDsK_fpMVtSNEU8vIqvWZWvG4cV7VYMZ7xHEEljUwgMcrKjr8SDaIn-bUSWeOcfswABLf9lHUa99tn6voyH17B90voGdg6oA/w680/f592f9493c7b149d5b42e7c3c04edfc689ca89c7c5bdcce29feb249e92e6a89a_200.jpeg",
"Description":"Adobe Photoshop Touch is a mobile version of the popular graphics editor. Of course to a full analogue of the desktop version it does not hold, however, many useful features are still there. Making the camera, you can immediately start to process it.\n\nAs the senior counterpart, there is the possibility of working with layers and various filters that will provide a comfortable editing, even if the user first installed Adobe Photoshop Touch. The program's interface is very comfortable and perfectly sharpened by touch control. In the center is the area of the image, and the top and bottom tool.\n\nThe developers have done everything possible to make the user feel as comfortable as possible when editing, and added a cool feature called Refine Edge. This feature allows you to highlight the difficult parts in the pictures with the fingertips. Also worth noting is the dark Google Images, allowing users to search and download images directly from the app.\n\nAppearance of the program is satisfactory. Dominated by dark colors, particularly black and gray. All elements of the program opens smoothly and beautifully, so in terms of performance here too, all at the highest level.\n\nAdobe Photoshop Touch is a useful and convenient program for processing images of NAS smartphones and tablets. A large selection of tools allows you to quickly and efficiently edit images with all the facilities without using a personal computer.",
"M":"Null",
"U":"April 27, 2022",
"V":"1.7.7",
"Link":"Null",
"Size":"Null"}]
